[
    {
        "department": "Continuing Education",
        "academicLevel": "Undergraduate",
        "overview": "<p>Department website: <a href=\"http://www.odu.edu/cepd\" target=\"_blank\" rel=\"noopener\">http://www.odu.edu/cepd</a></p><p><span class=\"SubheadingCharChar\">Renee R. Felts, </span>Associate Vice President, Continuing Education<br>\nRobert Doherty, Director, Continuing Education</p>\n<p><span class=\"SubheadingCharChar\">Continuing Education is focused on delivering practical, applied knowledge through its non-credit and credit-bearing courses, certificates and certification preparatory classes. Staff interact with each of the academic colleges to utilize the existing courses in an interdisciplinary fashion, frequently at the request of the military, businesses and various industry sectors.</span></p>\n<h2><span class=\"SubheadingCharChar\">Mission</span></h2>\n<p>To meet the evolving needs of our local, regional and global community via online and face-to-face offerings.&nbsp; We help students, professionals and lifelong learners move ahead and stay ahead.</p>\n<h2>Vision</h2>\n<p>Continuing Education will seek to add value to University programs by engaging with students, faculty, and alumni to help achieve their personal and professional goals.</p>\n<h2>Bachelor of Science in Interdisciplinary Studies with a Major in Leadership</h2>\n<p>Continuing Education coordinates with the College of Arts and Letters to offer a Bachelor of Science in Interdisciplinary Studies with a major in Leadership.&nbsp; For detailed information on the degree program, please refer to the <a href=\"http://catalog.odu.edu/undergraduate/collegeofartsletters/interdisciplinarystudies/\">College of Arts and Letters Interdisciplinary Studies</a> section of this Catalog.</p>\n<h2>Prior Learning Assessment</h2>\n<p><span class=\"s1\">The Prior Learning Assessment unit offers students the opportunity to have their prior learning assessed and applied for academic credit. Visit&nbsp;<a href=\"https://www.odu.edu/academics/academic-records/evaluation-of-credit/prior-learning\">www.odu.edu/priorlearning </a>for more information.</span></p>\n<h2><span class=\"s1\">Center for Professional Development</span></h2>\n<p><span class=\"s1\">The primary mission </span>of the Center for Professional Development (CPD) is to develop interdisciplinary certificate programs targeted for specific groups of professionals.&nbsp; The CPD will work across the ODU campus, including all academic colleges as well as ODUGlobal, in developing new multidisciplinary certificates.&nbsp; An undergraduate certificate program in Professional Leadership is administered by the Center and the Continuing Education unit.</p>\n<p>Please refer to the course listings in this Catalog for Center for Professional Development (CPD) courses.</p><a name=\"courseinventory\"> </a>",
        "programs": {
            "Certificate Programs": [
                "Digital Forensics Certificate",
                "Professional Leadership Certificate"
            ],
            "Non-Credit Continuing Education Programs": [
                "<p><strong>XHSP 3000- Hospitality Management Certificate- </strong>The Hospitality Management Certificate is broken down into 3 Courses that each contain 4 Modules and last 4 weeks. The courses include Sales &amp; Marketing, Hotel Operations, and Personnel &amp; Financial Management. The content includes an explanation of both the management and operational functions of lodging operations, an overview of the history and challenges of the lodging industry, identifies traits and behaviors of successful lodging leaders, gives a strong base for revenue management, labor and operational budgeting, safety and security, and an exploration of the future of the industry.</p>",
                "<p><strong>XCMA 2000- Certified Medical Assistant- </strong>Our program includes three in-demand healthcare certifications: Clinical Medical Assistant, EKG Technician and Phlebotomy Technician. The program combines convenient online course with in-person clinical experience supervised by health professionals. In as little as five months, students are be prepared to sit for nationally recognized exams through the National Health Career Association.</p>",
                "<p><strong>XMBC 3000- Medical Billing and Coding-</strong> This program includes two in-demand healthcare certifications: Certified Professional Biller (CPB) and Certified Professional Coder (CPC). Throughout the 30-week online course, students will learn about health insurance, billing principles, medical terminology, medical records, and professional coding services for medical providers, along with job preparation guidance. The program is taught by industry experts from the credentialing body, AAPC, and includes textbooks, practice exams, certification exams, real-world practice software, and career services.</p>",
                "<p><strong>XHLC 2000- Medical Laboratory Assistant- </strong>The Medical Laboratory Assistant program delves into the processes of collecting, preparing, and transferring patient samples, alongside performing a variety of tests on blood, urine, and other bodily fluids. Included in this program are the Certified Medical Lab Assistant (CMLA) and Certified Phlebotomy Technician (CPT) certifications.</p>",
                "<p><strong>XHLC 2010- Surgical Technologist-</strong> The Surgical Technologist program instructs you on collaborating with and assisting surgeons, nurses, and additional healthcare personnel throughout surgical procedures. Included in this course is the Tech in Surgery - Certified (TS-C) certification.</p>",
                "<p><strong>XHLC 2020- Surgical/Sterile Processing Technician-</strong> Our unique Surgical/Sterile Processing dual training program provides specialized preparation for two high-demand and crucial surgery specialties. Included in this program are the Tech in Surgery - Certified (TS-C) and Certified Registered Central Services Technician (CRCST) certifications.</p>",
                "<p><strong>XHLC 2030- Medical Scribe Professional-</strong> The Medical Scribe Professional program focuses on the meticulous documentation of medical records, an essential skill within the healthcare industry. Included in this course is the Apprentice Medical Scribe Professional (AMSP) certification.</p>",
                "<p><strong>XHLC 2040- Medical Scribe &amp; Administrative Professional- </strong>The Medical Scribe and Administrative Professional program offers comprehensive training in both Medical Scribe duties and administrative tasks within medical front office settings. Included in this program are the Apprentice Medical Scribe Professional (AMSP) and Certified Medical Administrative Assistant (CMAA) certifications.</p>",
                "<p><strong>XHLC 2050- Clinical Medical Assistant &amp; Scribe Professional-</strong> The Clinical Medical Assistant and Scribe Professional program offers training for two highly sought-after healthcare roles: medical assisting and scribing. By equipping learners with expertise in multiple areas, it sets them apart in the field. Included in this program are the Apprentice Medical Scribe Professional (AMSP), Certified Medical Administrative Assistant (CMAA) and Certified Clinical Medical Assistant (CCMA) certifications.</p>",
                "<p><strong>XHLC 2060- Dental Assistant-</strong> The Dental Assistant program enables learners to embark on a career in dental healthcare by providing the essential knowledge and skills needed to prepare for the Registered Dental Assistant (RDA) certification examination. Included in this course is the Registered Dental Assistant (RDA) certification.</p>",
                "<p><strong>XHLC 2070- Physical Therapy Aide and Administration Specialist-</strong> The Physical Therapy Aide and Administrative Specialist program opens doors to career prospects in settings such as Rehabilitation/Physical Therapy Practices, Skilled Nursing Facilities, Hospitals, and Health/Wellness Centers. Included in this program are the Physical Therapy Technician Certification (PTTC) and Certified Medical Administrative Assistant (CMAA) certifications.</p>",
                "<p><strong>XHLC 2080- Sterile Processing Technician-</strong> The Sterile Processing Technician program equips you for employment in surgical environments across a range of settings, including hospitals, surgical centers, clinics, and other medical facilities. Included in this course is the Certified Registered Central Services Technician (CRCST) certification.</p>",
                "<p><strong>XHLC 2090- Behavior Technician and the Medical Office-</strong> The Behavior Technician and Medical Office dual-certification training course offers a comprehensive curriculum that encompasses both front office skills and expertise in working within the behavioral health field. Included in this program are the Registered Behavior Technician (RBT) and Certified Medical Administrative Assistant (CMAA) certifications.</p>",
                "<p><strong>XHLC 2100- Behavior Technician Specialist- </strong>The Behavior Technician Specialist certification enables you to conduct individual patient sessions and provide behavior analysis services, all supervised by a licensed Board Certified Behavior Analyst (BCBA). Included in this course is the Registered Behavior Technician (RBT) certification.</p>",
                "<p><strong>XHLC 2110- Allied Healthcare Professional-</strong> The Allied Healthcare Professional program serves as a gateway into the healthcare sector, integrating the expertise of pharmacy technician, electronic health records management, billing and coding, and medical office administration. Included in this program are the CMAA (Certified Medical Administrative Assistant), CEHRS (Certified Electronic Health Records Specialist, CPhT (Certified Pharmacy Technician Certification), and MCBC (Medical Coder &amp; Biller Certification) certifications.</p>",
                "<p><strong>XHLC 2120- Electronic Health Records Specialist- </strong>The Electronic Health Records Specialist program prepares individuals for healthcare careers by offering thorough training in the management of electronic health records. Included in this course is the CEHRS (Certified Electronic Health Records Specialist) certification.</p>",
                "<p><strong>XHLC 2130- Healthcare Administration Professional-</strong> The Healthcare Administration Professional program offers extensive education and training for individuals aiming to thrive in healthcare administration and management positions. Included in this program are the CMAA (Certified Medical Administrative Assistant), CEHRS (Certified Electronic Health Records Specialist), and MCBC (Medical Coder &amp; Biller Certification) certifications.</p>",
                "<p><strong>XHLC 2140- Cardio-Phlebotomy Technician- </strong>The Cardio-Phlebotomy Technician program provides specialized training for individuals aspiring to master both EKG (electrocardiography) and phlebotomy techniques, equipping them for crucial roles in healthcare diagnostics. Included in this program are the CET (Certified EKG Technician) and CPT (Certified Phlebotomy Technician) certifications.</p>",
                "<p>The Registered Play Therapy Program provides professionals and students in the community with the opportunity to learn more about play therapy or to receive the training necessary to become a Registered Play Therapist (RPT). The Play Therapy program is offered as a series of eight (8) weekend workshops worth 19 continuing education hours each (16 contact CE's and 3 non-contact CE’s). Individuals can attend one or all of the workshops.&nbsp;Old Dominion University is approved by the Association for Play Therapy to offer continuing education specific to play therapy (APT Approved Provider #08-234).</p>",
                "<p>The Registered Play Therapy workshops are aligned with the guidelines established by the <em>Association for Play Therapy</em> and pertain to five main areas:&nbsp;</p>",
                "<p><strong>XPCL 4000-Workshop #1: Principles of Play Therapy- </strong>This workshop will provide information about the rationale, philosophy, history, and theoretical underpinnings specific to the application of play therapy with various populations and in different settings. Basic facilitation skills, specific goals, and the role of the play therapist will be explored and practiced in relation to specific theories and in terms of general process of play therapy.</p>",
                "<p><strong>XPCL 4010-Workshop #2: Expressive Arts in Play Therapy- </strong>The therapeutic power of selected games, structured activities and expressive arts will be explored as they pertain to play therapy. Techniques specific to art, drama, children's literature, puppets, and music will be illuminated as ideal mediums through which children and adolescents express and heal themselves through the process of play therapy. Basic techniques and strategies for incorporating such tools and techniques will be described, demonstrated, and practiced.</p>",
                "<p><strong>XPCL 4005-Workshop #3: Games, Activities, and Narrative Techniques in Play Therapy- </strong>The therapeutic power of selected games, structured activities, and narrative techniques will be explored as they pertain to play therapy. Basic techniques and strategies for incorporating such tools and techniques will be described, demonstrated, and practiced.</p>",
                "<p><strong>XPCL 4015- Workshop #4: Systematic Interventions: Family Play Therapy and Filial Therapy- </strong>Fundamental, theoretical, and philosophical concepts related to systems theory and utilizing play therapy techniques in family counseling will be presented. Basic skills and methods to incorporate in family play therapy will be described, demonstrated, and practiced. In addition, methods will be covered illustrating how to implement filial therapy for parents to become healthy agents in their children's lives.</p>",
                "<p><strong>XPCL 4030- Workshop #5: Group Play Therapy: Play Therapy Skills and Methods in Group Work- </strong>Theoretical and philosophical concepts of Group Play Therapy with children, adolescents, and adults will be discussed. Group logistics, process, conflict resolution, and group facilitation skills will be described. Basic skills and methods to incorporate in group play therapy will be described, demonstrated, and practiced. In addition, multicultural and ethical considerations in group play therapy will be addressed.</p>",
                "<p><strong>XPCL 4025- Workshop #6: Play Therapy and Creative Interventions with Adolescents, Teens, and Adults- </strong>Research has indicated that play therapy is an effective treatment modality with people of all ages. This workshop will explore the process of play therapy and creative interventions when working with adolescents and adults. Basic skills and methods to incorporate in play therapy with adolescents and adults will be described, demonstrated, and practiced. Multicultural considerations and societal influences that specifically pertain to this population will also be addressed.</p>",
                "<p><strong>XPCL 4020- Workshop #7: &nbsp;Utilizing Sandtray in Play Therapy- </strong>Through experiential sand tray exercises and didactic methods, information about the rationale, history, and general application of sand tray in play therapy will be illustrated. Basic facilitation skills, theoretical constructs, and strategies for processing sand tray will be discussed, demonstrated, and practiced.</p>",
                "<p><strong>XPCL 4045- Workshop #8: Addressing Trauma, Grief, and Loss Through Play Therapy- </strong>This workshop will investigate specific issues faced by children, adolescents, and families affected by difficult environmental and systematic situations. The implications of trauma, grief, and loss as a result of abuse, crisis, death and divorce will be reviewed as they pertain to the process. The process of play, techniques, treatment plans and consultation procedures will also be explored. Skills and methods to incorporate play therapy techniques to address trauma, grief, and loss will be described, demonstrated, and practiced.</p>",
                "<p><strong>XEDC 1511- General Financial Planning Principles, Professional Conduct, and Regulation- </strong>This course examines basic financial planning concepts for developing client relationships; gathering, analyzing, and evaluating financial documents, statements, and other information; developing and communicating relevant recommendations to clients; implementing recommendations through the use of a financial planning team; and monitoring the financial plan on a periodic basis, all within CFP Board professional and regulatory standards. Students will develop a pragmatic perspective of the field of financial planning as they learn to analyze personal financial statements, understand time value of money concepts, explore education funding techniques, advise clients regarding the management of debt, apply behavioral finance concepts, gain an understanding of federal and state regulatory requirements, learn the ethical environment of financial planning and integrate the legal and economic aspects of financial planning within a practice.</p>",
                "<p><strong>XEDC 1512- Risk Management, Insurance, and Employee Benefits Planning- </strong>This course explores fundamental insurance, annuity, and employee benefit concepts and products. Students will gain knowledge of the principles of risk and insurance; learn how to analyze and evaluate risk exposures; and understand the concepts of personal and business insurance for life, health, disability, long-term care and property insurance. Students will also develop perspectives regarding the integration of social insurance (e.g. Medicare, workers compensation) within the framework of financial planning. Equity-based compensation, non-qualified deferred compensation and other employee benefits will also be presented and discussed.</p>",
                "<p><strong>XEDC 1513- Investment Planning- </strong>This course examines the characteristics, uses and taxation of investment vehicles: stocks, bonds, cash and cash equivalents, promissory notes, guaranteed investment contracts, real estate, and alternative investments. Students will also develop an understanding of the various types of risk: systematic and unsystematic, purchasing power, interest rate, business, and financial risk. Students are introduced to quantitative investment concepts, measures of investment returns, bond and stock valuation concepts, investment theory, portfolio development and analysis, investment strategies, asset allocation, and asset pricing models.</p>",
                "<p><strong>XEDC 1514- Tax Planning- </strong>This course focuses on income tax fundamentals and calculations, tax accounting, characteristics and income taxation of business entities, basis, depreciation, and cost recovery concepts. The impact of the alternative minimum tax (AMT), passive activity, at-risk rules, charitable contributions and charitable deductions on a client’s financial plan is also studied. Students will gain an understanding of the tax consequences of like-kind exchanges and the disposition of property and will learn how the loss of a spouse through death or divorce affects a client’s tax status.</p>",
                "<p><strong>XEDC 1515- Retirement Savings and Income Planning- </strong>Students will be exposed to retirement needs analyses, types and characteristics of retirement plans, qualified plan rules and options, and provisions of tax-advantaged plans. The effects of ERISA on retirement plans is examined and the impact of Social Security on a client’s retirement plan is also discussed. Students will gain an understanding of plan distribution options, rules, alternatives, and taxation, and will also explore key factors affecting plan selection for businesses and investment considerations for retirement plans.</p>",
                "<p><strong>XEDC 1516- Estate Planning- </strong>This course analyzes the various techniques and strategies used in developing estate plans based on client criteria and needs. Property titling, property transfer at death, gifting strategies, and sources of estate liquidity are discussed. Students will also gain insight on wills, probate, and the types, uses and taxation of trusts during estate planning.</p>",
                "<p><strong>XEDC 1517- Capstone: Financial Plan Development Course- </strong>Students participate in a case analysis and evaluation in which the following major areas of financial planning are integrated:</p>",
                "<p><strong>XEDC 1165- SHRM Learning System-</strong> The SHRM Learning System for SHRM-CP and SHRM-SCP includes five modules covering the comprehensive SHRM Body of Competency and Knowledge™ (SHRM BoCK™) so you'll learn everything you need for the SHRM-CP or SHRM-SCP exam. Study with learning modules that provide an in-depth exploration of the knowledge domains and behavioral competencies tested on the SHRM exams. SHRM Certified Professional (SHRM-CP™) and SHRM Senior Certified Professional (SHRM-SCP™) are the new standard for all HR professionals around the globe, as it is among the first HR certification that is focused on the practical, real-life information HR professionals need to excel in their careers today, including behavioral competencies, knowledge and skills.</p>",
                "<p><strong>XEDC 1164- SHRM Essentials-</strong> The perfect course for managers who need to know basic HR concepts BEFORE disciplinary action is required and HR has to get involved. This program provides a broad overview of the human resource function. &nbsp;Key topic areas include: Essentials of HR Management, Employment Law, Effective Recruitment, Basics of Compensation, and Orienting and Training your employees.</p>",
                "<p><strong>XLGL 3010- Paralegal Certificate Program-</strong> This face-to-face offering is taught by an esteemed faculty of judges and attorneys. Students learn legal processes, court structure, interviewing, investigation, document preparation, file maintenance, correspondence, research, writing and analysis, as well as substantive topics of law, such as Tort Law, Contract Law and Civil Procedures. Students will be trained in online legal research with individual subscriptions to LexisNexis and Westlaw.</p>",
                "<p><strong>XLGL 3020- Paralegal Certificate Program, Self-Paced-</strong> The self-paced version of our Paralegal Certificate program is designed for students to study when convenient for them and can be done completely online. Students will be assigned their own attorney/judge liaison and learn legal processes, court structure, interviewing, investigation, document preparation, file maintenance, correspondence, research, writing and analysis, as well as substantive topics of law, such as Tort Law, Contract Law and Civil Procedures. Students will be trained in online legal research with individual subscriptions to LexisNexis and Westlaw.</p>",
                "<p><strong>XLSS 5010- Lean Six Sigma Green Belt Certification- </strong>This program focuses on managing quality projects utilizing the fundamentals of Lean and Six Sigma methodologies. Lean topics include the concepts of the elimination of waste and reduction of cycle time in organizational processes. Six Sigma principles consist of problem solving techniques, data collection and analysis, reduction of process variation, process capability and control, and continual improvement.</p>",
                "<p><strong>XLSS 5040- Lean Six Sigma Black Belt Certification-</strong> Build upon the process improvement skills acquired during the Green Belt certification with our industry-leading Lean Six Sigma Black Belt certification. In just seven sessions over the course of two to three months, you'll master the tools to mentor Green Belts and other team members using real-world process improvement methods. Black belts leverage the tools and concepts in their lean six sigma \"toolbox\" to successfully lead projects that deliver meaningful results to the organization.</p>",
                "<p><strong>XCYS 1050- Cybersecurity Fundamentals-</strong>&nbsp; This course is designed to introduce participants to the critical field of cybersecurity, emphasizing the skills and knowledge needed to navigate the evolving threat landscape. It adopts a workshop format to ensure a comprehensive learning experience, incorporating a mix of lectures, case studies, and hands-on labs. The course aims to prepare learners for the ISACA Cybersecurity Fundamentals Certificate Exam by covering a wide range of topics, from cybersecurity principles and privacy to risk management and security architecture.</p>",
                "<p><strong>XCYS 2050- Cybersecurity Bootcamp-</strong> Students gain hands-on experience, which provides preparation for real-world scenarios. This intensive program is taught by experienced professionals who contribute valuable insight on information security and cybersecurity and prepare students to pass top industry certifications.</p>",
                "<p><strong>XDGM 2020- Digital Marketing Bootcamp-&nbsp;</strong> The Digital Marketing Bootcamp is a part-time Career Bootcamp that teaches the essential skills necessary to launch a digital marketing career. Learners will start&nbsp; with the fundamentals and progress through a variety of strategies and topics to solve complex marketing challenges within the evolving tech space.</p>",
                "<p><strong>XSWD 2010- Software Development Bootcamp- 24 Week Part-Time-</strong> Over the course of 24 weeks, you will learn how to build, test, and deploy software applications using JavaScript on the client- (front-end) and server-side (back-end) of an application. Starting with fundamentals, you will quickly move into more complex programming concepts that are solidified through challenges, such as: pair programming, weekly projects, lab exercises, and code reviews. The projects that you create throughout the program will be used to build your portfolio, which will serve as a showcase of your work and be a valuable asset in your post-bootcamp job hunt. You will also receive time with a professional career mentor through one-on-one coaching sessions and bi-weekly workshops. In the final four weeks, you will work with a client and your classmates on a team to develop a real product. This is what we call your “capstone project”. At the end of the program, you will demonstrate your capstone project to an audience of hiring partners and tech community members at our Demo Day. This bootcamp part-time bootcamp is typically held during the weekday evenings and weekends.</p>",
                "<p><strong>XSWD 2020- Software Development Bootcamp- 12 Week Intensive-</strong> Over the course of 12 weeks, you will learn how to build, test, and deploy software applications using JavaScript on the client- (front-end) and server-side (back-end) of an application. Starting with fundamentals, you will quickly move into more complex programming concepts that are solidified through challenges, such as: pair programming, weekly projects, lab exercises, and code reviews. The projects that you create throughout the program will be used to build your portfolio, which will serve as a showcase of your work and be a valuable asset in your post-bootcamp job hunt. You will also receive time with a professional career mentor through one-on-one coaching sessions and bi-weekly workshops. In the final four weeks, you will work with a client and your classmates on a team to develop a real product. This is what we call your “capstone project.\" At the end of the program, you will demonstrate your capstone project to an audience of hiring partners and tech community members at our Demo Day. This intensive bootcamp is typically held each weekday, all day.</p>",
                "<p><strong>XDAB 2010- Data Science and Analytics Bootcamp, Extended Class-</strong> The Data Analytics Bootcamp is a part-time, flex, mentor-led, Career Bootcamp that covers a variety of tools used to drive and guide complex, big data-oriented decisions.&nbsp; Learners will become experts in analysis, cleaning, mining, synthesis, and decision-making in order to influence key decisions with an increasingly complex business environment.</p>",
                "<p><strong>XUIX 2010- UX/UI Design Bootcamp- </strong>The process for creating the outward facing appearance of a website or application is referred to as user interface (UI) design, while the process of gathering research and using data to inform design decisions is referred to as user experience (UX) design. In this program, you will learn both. Starting with the fundamentals, you will quickly advance through topics of increasing complexity, applying creative problem-solving skills to design, and iterating on your designs based on research. You will learn how to defend your designs with data using performance metrics that you create. Lastly, you will leave this program knowing how to clearly implement every step of the design process, from concept to full-scale design prototypes.</p>",
                "<p><strong>XTSB 2010- Tech Sales Bootcamp- </strong>The Tech Sales Bootcamp is an intensive program designed to provide learners with the skills and knowledge needed to succeed in today's digital marketplace. This program will help you understand technology sales concepts, develop relationships with clients, and quickly adapt to changing customer needs.</p>",
                "<p><strong>XITS 4000- IT Systems Support Specialist- </strong>Our online, asynchronous program is designed to equip you with the necessary skills and knowledge to become an IT Support Specialist. The program comprises multiple modules that cover essential topics such as technical support, hardware and operating systems, software, programming and databases, networking and storage, cybersecurity essentials, and cloud computing.</p>",
                "<p><strong>XITS 4010- Fundamentals of IT-</strong> The Fundamentals of IT program delivers comprehensive insights into basic computing principles and essential hardware components, ensuring a solid foundation in information technology through an in-depth exploration. This offering includes the following certification(s): CompTIA ITF+</p>",
                "<p><strong>XITS 4020- Microsoft Office Specialist-</strong> The Microsoft Office Specialist program provides essential computer skills, along with training in business communication, etiquette, and problem-solving, covering a broad range of topics necessary for proficiency in the modern workplace. This offering includes the following certification(s): Microsoft Office Specialist (MOS)&nbsp;</p>",
                "<p><strong>XITS 4030- AWS Solutions Architect Associate-</strong> This AWS Certification course caters to IT specialists aiming to elevate their career path with a focus on Cloud technology within the information technology domain. This offering includes the following certification(s): AWS Certified Solutions Architect - Associate (CSAA)&nbsp;</p>",
                "<p><strong>XITS 4040- Cybersecurity Analyst (CySA+)-</strong> The Cybersecurity Analyst program prepares participants for a profession in cybersecurity, with a focus on defensive tactics designed to protect organizations against emerging threats and vulnerabilities. This offering includes the following certification(s): CompTIA CySA+</p>",
                "<p><strong>XITS 4050- Ethical Hacker (PenTest+)-</strong> The Ethical Hacker program prepares participants for a cybersecurity career, focusing on offensive tactics designed to proactively defend organizations from potential threats and ensure their digital assets remain secure. This offering includes the following certification(s): CompTIA PenTest+&nbsp;</p>",
                "<p><strong>XITS 4060- Cloud Computing (Cloud+)-</strong> The CompTIA Cloud+ Certification training program is tailored for IT professionals aiming to expand their roles, enhance their income prospects, and demonstrate their proficiency in the dynamic field of cloud computing. This offering includes the following certification(s): CompTIA Cloud +</p>",
                "<p><strong>XITS 4070- Linux Administrator-</strong> Gain the vital skills necessary for a back-end IT professional, focusing on the installation, configuration, and maintenance of Linux operating systems, ensuring robust and efficient technological infrastructures. This offering includes the following certification(s): CompTIA Linux+</p>",
                "<p><strong>XITS 4080- IT Network Technician-</strong> The IT Network Technician program is designed to impart knowledge in a range of networking technologies, fostering expertise in network administration and support, equipping learners with the skills necessary for professional advancement in the field. This offering includes the following certification(s): CompTIA Network+</p>",
                "<p><strong>XITS 4090- IT Security Specialist-</strong> The IT Security Specialist program enables students to elevate their IT careers by achieving expertise in the security domain, through a comprehensive 6-week curriculum dedicated to cultivating advanced protective strategies and knowledge. This offering includes the following certification(s): CompTIA Security+&nbsp;</p>",
                "<p><strong>XITS 4100- Project Management Essentials-</strong> Project Management Essentials equips participants with the crucial skills needed to manage and direct projects successfully across various industries, ensuring effective leadership and organizational outcomes. This offering includes the following certification(s): Certified Associate in Project Management (CAPM)</p>",
                "<p><strong>XITS 4110- Information Systems Security Professional-</strong> The Information Systems Security Professional certification represents the pinnacle of achievement and the most esteemed credential in the realm of data security, setting the industry standard for excellence and expertise. This offering includes the following certification(s): Certified Information Systems Security Professional (CISSP)</p>",
                "<p><strong>XITS 4120- Cisco Certified Network Associate-</strong> The Cisco Certified Network Associate certification is perfect for IT professionals aiming to advance their careers by mastering comprehensive computer networking skills. This offering includes the following certification(s): Cisco Certified Network Associate (CCNA)</p>",
                "<p><strong>XITS 4130- PC Technician-</strong> The PC Technician program equips learners with the capabilities to manage, troubleshoot, and resolve problems with personal computers, offering an extensive IT curriculum that covers all essential aspects of PC maintenance and repair. This offering includes the following certification(s): CompTIA A+</p>",
                "<p><strong>XITS 4140- Cloud Technology Professional-</strong> The Cloud Technology Professional program offers a prime opportunity for IT professionals looking to progress in their careers with a specialization in cloud computing. This offering includes the following certification(s): CompTIA Cloud+; AWS Certified Solutions Architect - Associate (CSAA)&nbsp;</p>",
                "<p><strong>XITS 4150- Healthcare IT Technician-</strong> The Healthcare IT Technician program offers a comprehensive educational experience for those aiming to enter the healthcare industry with a focus on Information Technology (IT), preparing individuals for a specialized career at the intersection of health and technology. This offering includes the following certification(s): CompTIA Network+, CompTIA A+, Certified Electronic Health Records Specialist (CEHRS)</p>",
                "<p><strong>XITS 4160- IT Help Desk Administrator-</strong> The IT Help Desk Administrator program serves as an ideal entry point into the IT field, concentrating on the development and upkeep of network systems for businesses and organizations, preparing participants for critical support roles. This offering includes the following certification(s): CompTIA Network+, CompTIA A+</p>",
                "<p><strong>XITS 4170- IT Security and Network Technician-</strong> The IT Security and Network Technician training program propels your career forward in the specialized fields of IT security and network administration, offering advanced knowledge and skills for a competitive edge in these critical areas of technology. This offering includes the following certification(s): CompTIA Network+, CompTIA Security+</p>",
                "<p><strong>XITS 4180- IT Support Professional-</strong> The IT Support Professional program offers an ideal starting point for those interested in pursuing advanced IT certifications, providing the foundational knowledge and skills necessary for success in the IT field. This offering includes the following certification(s): CompTIA IT Fundamentals (CompTIA ITF+), CompTIA A+</p>",
                "<p><strong>XITS 4190- Networking Specialist-</strong> The Networking Specialist program delivers two certifications designed to solidify your foundation for a robust career in networking, equipping you with the skills and knowledge essential for success in this dynamic field. This offering includes the following certification(s): Cisco Certified Technician (CCT) – Routing and Switching, CompTIA Network+&nbsp;</p>",
                "<p><strong>XITS 4200- Cloud Specialist-</strong> The Cloud Specialist program provides an in-depth understanding of cloud computing concepts, equipping learners to excel in achieving three key certifications fundamental to a successful career in the cloud technology landscape. This offering includes the following certification(s): Microsoft Azure Fundamentals, AWS Certified Cloud Practitioner, CompTIA Cloud+</p>",
                "<p>Old Dominion University will no longer be admitting new cohorts to the Career Switcher program. Although we will continue to support current students enrolled in the Career Switcher program through Spring 2025, we will no longer be offering the program for prospective students. For students who have completed Level I and are entering or already taking Level II professional development, your modules will continue to be available to you as needed, through Spring 2025. <em>The Career Switcher program is certified by the Virginia Department of Education.</em></p>",
                "<p>Assistant Director for Curriculum and Development:&nbsp; Pete Baker<br>\nAssistant Director for Student Support:&nbsp; Samantha Fabio</p>",
                "<p><strong>Level II Preparation: </strong>Preparation begins during the first year of employment.&nbsp;Career Switchers attend a minimum of five seminars to expand the intensive preparation requirements associated with instructional topics.&nbsp;&nbsp;The five seminars award a minimum of 20 cumulative instructional hours and feature various instructional techniques. During Level II, a school mentor is assigned to assist the candidate throughout their first year of employment.&nbsp;&nbsp;&nbsp;&nbsp;</p>",
                "<p><strong>XPCL 5096- How’s Your First Year Going- 4 contact hours- </strong>This workshop deals with issues that first-year teachers face or have encountered. This workshop is designed&nbsp;to support new teachers and facilitate the successful entry of transitioning beginning teachers into the teaching profession by addressing topics that impact their day-to-day professional and teaching decisions.</p>",
                "<p><strong>XPCL 5097- Communication Skills for Teachers- 4 contact hours- </strong>This workshop deals with the relationships and communication skills teachers need to develop with students,&nbsp;parents, administrators, and colleagues. This workshop will focus on appropriate and effective ways to communicate with parents,&nbsp;administrators, colleagues, and&nbsp;students, providing some guided practice.&nbsp;The session&nbsp;will include an analysis of stakeholders, a review of types of teacher communications, some positive techniques and strategies, and an evaluation&nbsp;of several real-world examples.</p>",
                "<p><strong>XPCL 5098- Data Driven Instruction for Student Achievement- 4 contact hours- </strong>Per the Virginia Department of Education, “Candidates will know about, create, and use appropriate and effective measurements in teaching that shall provide dependable information about student achievement. This course will discuss what evidence should be collected of candidates' success in the first years of teaching and the candidates' impact on student achievement.”</p>",
                "<p><strong>XPCL 5085- Behavior Management- 4 contact hours-</strong> Candidates will acquire strategies to help prevent behavior problems, identify actions that need to be taken when behavior problems occur, and learn how to effectively help students resolve problems in the classroom.</p>",
                "<p><strong>XPCL 5086- Empowering Teachers who serve English as a Language Learners (ESL)- 4 contact hours- </strong>The ESL workshop is designed to give new teachers some basic information about who the ESL students are. The workshop is mandatory because at some point of the participants teaching experience, they will have ELL students in their classroom. The participants will learn how the ESL students make it into the classroom. Participants will also get some teaching strategies useful when differentiating their instruction for English Language Learners. The goals of the workshops are to identify how these ESL students are enrolled, Demonstrate and create awareness about ESL students various Linguistic Proficiency level and what that means to the classroom teacher. Participants will become familiar with ESL Assessment like the WAPT and annual ACCESS for ESL students. Participants will learn about culture and multicultural in the classroom and how to use this knowledge when planning instruction. Finally, participants will develop awareness about LEP students SOL accommodations and how these accommodations impact ESL students with Special Education needs.&nbsp;</p>",
                "<p><strong>XPCL 5088- Strategies for Success in the Classroom- 4 contact hours- </strong>Candidates will acquire practical strategies that they will be able to use with their students.&nbsp;&nbsp;This workshop includes instructional, vocabulary, memory, and review activities that can be used with any student, including slow learners and special education students.&nbsp;</p>",
                "<p><strong>XPCL 5089- Poverty:&nbsp;&nbsp;Students Achievement for Rural Urban Learners- 4 contact hours- </strong>Candidates will learn strategies to promote students’ academic success effectively with urban and rural learners in poverty based on theoretical concepts.&nbsp;&nbsp;Additionally, they will gain insights regarding the impact of poverty for schools, leaders, teachers and students. The participants will engage in a variety of experiences for adult learners to increase the teachers’ awareness of poverty and educators’ roles to address student scholastic achievement in school. The workshop will explore through the use of this PowerPoint presentation as guidance document to support practical application in this seminar. This interactive session will highlight the poverty research by Dr. Ruby Payne.&nbsp;</p>",
                "<p><strong>XPCL 5090- The Teacher as a Professional:&nbsp;Communicating with Stakeholders- 4 contact hours- </strong>Participants will become familiar with the issues and standards related to professionalism and teacher evaluation. The participants will become familiar with The Virginia Standards for the Professional Practice of Teachers (VSPPT) and discuss expectations for teacher conduct within and without the classroom. Concrete strategies and tools for interaction with students, parents, administrators, and colleagues will be provided.&nbsp;Participants will engage in role-play to appreciate their responsibility in building supportive relationships with their students and their families.&nbsp;In addition, Assessment of, and for, Student Learning will be addressed, as grading is the primary mode of communication with parents, particularly at the secondary level.&nbsp;</p>",
                "<p>&nbsp;<strong>XPCL 5091- Parents:&nbsp;A User’s Guide- 4 contact hours- </strong>This workshop will deal with the relationship teachers need to develop with parents, outline concerns from a parent's perspective, from a school's perspective, and develop responses to those concerns.&nbsp;This workshop will employ teaching strategies embedded into the PowerPoint, therefore providing practical application to the content (Communication with Parents).&nbsp;The agenda will include overviews and strategies, definition of stakeholders, analysis of the types of teacher-parent communication, presentation of positive techniques and strategies, and the review, evaluation, and practical use of authentic case studies.</p>",
                "<p><strong>XPCL 5093- Diversity in the Classroom- 4 contact hours- </strong>Participants will define diversity and identify what constitutes diversity in the classroom.&nbsp;Students will discern personal subjectivities and examine how those subjectivities affect student populations in the classroom.&nbsp;Students will understand the microsystem, exosystem, and macrosystem that influences the development of individuals through Bronfenbrenner’s Ecological Model. Students will engage with culture, language, and socioeconomic status to gain a deeper understanding of the backgrounds students come with&nbsp;to school.</p>"
            ]
        },
        "courses": {}
    },
    {
        "department": "Continuing Education",
        "academicLevel": "Graduate",
        "overview": "<p>Department website: <a href=\"http://www.odu.edu/cepd\" target=\"_blank\" rel=\"noopener\">http://www.odu.edu/cepd</a></p><div class=\"lfsharedcontent\">\n<div class=\"lfsharedcontentcontainer\">\n<p><span class=\"SubheadingCharChar\">Renee Felts, Associate Vice President, Continuing Education<br>\nRobert Doherty, Director, Continuing Education</span><br type=\"_moz\">\n&nbsp;</p>\n<p><span class=\"SubheadingCharChar\">Continuing Education is focused on delivering practical, applied knowledge through its non-credit, and credit-bearing courses, certificates and certification preparatory classes. Staff interact with each of the academic colleges to utilize the existing courses in an interdisciplinary fashion, frequently at the request of the military, businesses and various industry sectors.</span></p>\n<h2><span class=\"SubheadingCharChar\">Mission</span></h2>\n<p>Continuing Education will meet the evolving needs of our local, regional and global community via online and face-to-face offerings. We help students, professional and lifelong learners move ahead and stay ahead.</p>\n<h2>Vision</h2>\n<p>Continuing Education will seek to add value to University programs by engaging with students, faculty, and alumni to help achieve their personal and professional goals.</p>\n</div>\n</div>",
        "programs": {
            "Certificate Programs": [
                "Public Sector Leadership Certificate"
            ]
        },
        "courses": {},
        "continueeducation": {
            "Prior Learning Assessment": [
                "<p><span class=\"s1\">The Prior Learning Assessment unit offers students the opportunity to have their prior learning assessed and applied for academic credit. Visit&nbsp;<a href=\"https://www.odu.edu/academics/academic-records/evaluation-of-credit/prior-learning\">www.odu.edu/priorlearning </a>for more information.</span></p>"
            ],
            "Non-Credit Continuing Education Programs": [
                "<p><strong>XHSP 3000- Hospitality Management Certificate- </strong>The Hospitality Management Certificate is broken down into 3 Courses that each contain 4 Modules and last 4 weeks. The courses include Sales &amp; Marketing, Hotel Operations, and Personnel &amp; Financial Management. The content includes an explanation of both the management and operational functions of lodging operations, an overview of the history and challenges of the lodging industry, identifies traits and behaviors of successful lodging leaders, gives a strong base for revenue management, labor and operational budgeting, safety and security, and an exploration of the future of the industry.</p>",
                "<p><strong>XCMA 2000- Certified Medical Assistant- </strong>Our program includes three in-demand healthcare certifications: Clinical Medical Assistant, EKG Technician and Phlebotomy Technician. The program combines convenient online course with in-person clinical experience supervised by health professionals. In as little as five months, students are be prepared to sit for nationally recognized exams through the National Health Career Association.</p>",
                "<p><strong>XMBC 3000- Medical Billing and Coding-</strong> This program includes two in-demand healthcare certifications: Certified Professional Biller (CPB) and Certified Professional Coder (CPC). Throughout the 30-week online course, students will learn about health insurance, billing principles, medical terminology, medical records, and professional coding services for medical providers, along with job preparation guidance. The program is taught by industry experts from the credentialing body, AAPC, and includes textbooks, practice exams, certification exams, real-world practice software, and career services.</p>",
                "<p><strong>XHLC 2000- Medical Laboratory Assistant- </strong>The Medical Laboratory Assistant program delves into the processes of collecting, preparing, and transferring patient samples, alongside performing a variety of tests on blood, urine, and other bodily fluids. Included in this program are the Certified Medical Lab Assistant (CMLA) and Certified Phlebotomy Technician (CPT) certifications.</p>",
                "<p><strong>XHLC 2010- Surgical Technologist-</strong> The Surgical Technologist program instructs you on collaborating with and assisting surgeons, nurses, and additional healthcare personnel throughout surgical procedures. Included in this course is the Tech in Surgery - Certified (TS-C) certification.</p>",
                "<p><strong>XHLC 2020- Surgical/Sterile Processing Technician-</strong> Our unique Surgical/Sterile Processing dual training program provides specialized preparation for two high-demand and crucial surgery specialties. Included in this program are the Tech in Surgery - Certified (TS-C) and Certified Registered Central Services Technician (CRCST) certifications.</p>",
                "<p><strong>XHLC 2030- Medical Scribe Professional-</strong> The Medical Scribe Professional program focuses on the meticulous documentation of medical records, an essential skill within the healthcare industry. Included in this course is the Apprentice Medical Scribe Professional (AMSP) certification.</p>",
                "<p><strong>XHLC 2040- Medical Scribe &amp; Administrative Professional- </strong>The Medical Scribe and Administrative Professional program offers comprehensive training in both Medical Scribe duties and administrative tasks within medical front office settings. Included in this program are the Apprentice Medical Scribe Professional (AMSP) and Certified Medical Administrative Assistant (CMAA) certifications.</p>",
                "<p><strong>XHLC 2050- Clinical Medical Assistant &amp; Scribe Professional-</strong> The Clinical Medical Assistant and Scribe Professional program offers training for two highly sought-after healthcare roles: medical assisting and scribing. By equipping learners with expertise in multiple areas, it sets them apart in the field. Included in this program are the Apprentice Medical Scribe Professional (AMSP), Certified Medical Administrative Assistant (CMAA) and Certified Clinical Medical Assistant (CCMA) certifications.</p>",
                "<p><strong>XHLC 2060- Dental Assistant-</strong> The Dental Assistant program enables learners to embark on a career in dental healthcare by providing the essential knowledge and skills needed to prepare for the Registered Dental Assistant (RDA) certification examination. Included in this course is the Registered Dental Assistant (RDA) certification.</p>",
                "<p><strong>XHLC 2070- Physical Therapy Aide and Administration Specialist-</strong> The Physical Therapy Aide and Administrative Specialist program opens doors to career prospects in settings such as Rehabilitation/Physical Therapy Practices, Skilled Nursing Facilities, Hospitals, and Health/Wellness Centers. Included in this program are the Physical Therapy Technician Certification (PTTC) and Certified Medical Administrative Assistant (CMAA) certifications.</p>",
                "<p><strong>XHLC 2080- Sterile Processing Technician-</strong> The Sterile Processing Technician program equips you for employment in surgical environments across a range of settings, including hospitals, surgical centers, clinics, and other medical facilities. Included in this course is the Certified Registered Central Services Technician (CRCST) certification.</p>",
                "<p><strong>XHLC 2090- Behavior Technician and the Medical Office-</strong> The Behavior Technician and Medical Office dual-certification training course offers a comprehensive curriculum that encompasses both front office skills and expertise in working within the behavioral health field. Included in this program are the Registered Behavior Technician (RBT) and Certified Medical Administrative Assistant (CMAA) certifications.</p>",
                "<p><strong>XHLC 2100- Behavior Technician Specialist- </strong>The Behavior Technician Specialist certification enables you to conduct individual patient sessions and provide behavior analysis services, all supervised by a licensed Board Certified Behavior Analyst (BCBA). Included in this course is the Registered Behavior Technician (RBT) certification.</p>",
                "<p><strong>XHLC 2110- Allied Healthcare Professional-</strong> The Allied Healthcare Professional program serves as a gateway into the healthcare sector, integrating the expertise of pharmacy technician, electronic health records management, billing and coding, and medical office administration. Included in this program are the CMAA (Certified Medical Administrative Assistant), CEHRS (Certified Electronic Health Records Specialist, CPhT (Certified Pharmacy Technician Certification), and MCBC (Medical Coder &amp; Biller Certification) certifications.</p>",
                "<p><strong>XHLC 2120- Electronic Health Records Specialist- </strong>The Electronic Health Records Specialist program prepares individuals for healthcare careers by offering thorough training in the management of electronic health records. Included in this course is the CEHRS (Certified Electronic Health Records Specialist) certification.</p>",
                "<p><strong>XHLC 2130- Healthcare Administration Professional-</strong> The Healthcare Administration Professional program offers extensive education and training for individuals aiming to thrive in healthcare administration and management positions. Included in this program are the CMAA (Certified Medical Administrative Assistant), CEHRS (Certified Electronic Health Records Specialist), and MCBC (Medical Coder &amp; Biller Certification) certifications.</p>",
                "<p><strong>XHLC 2140- Cardio-Phlebotomy Technician- </strong>The Cardio-Phlebotomy Technician program provides specialized training for individuals aspiring to master both EKG (electrocardiography) and phlebotomy techniques, equipping them for crucial roles in healthcare diagnostics. Included in this program are the CET (Certified EKG Technician) and CPT (Certified Phlebotomy Technician) certifications.</p>",
                "<p>The Registered Play Therapy Program provides professionals and students in the community with the opportunity to learn more about play therapy or to receive the training necessary to become a Registered Play Therapist (RPT). The Play Therapy program is offered as a series of eight (8) weekend workshops worth 19 continuing education hours each (16 contact CE's and 3 non-contact CE’s). Individuals can attend one or all of the workshops.&nbsp;Old Dominion University is approved by the Association for Play Therapy to offer continuing education specific to play therapy (APT Approved Provider #08-234).</p>",
                "<p>The Registered Play Therapy workshops are aligned with the guidelines established by the <em>Association for Play Therapy</em> and pertain to five main areas:&nbsp;</p>",
                "<p><strong>XPCL 4000-Workshop #1: Principles of Play Therapy- </strong>This workshop will provide information about the rationale, philosophy, history, and theoretical underpinnings specific to the application of play therapy with various populations and in different settings. Basic facilitation skills, specific goals, and the role of the play therapist will be explored and practiced in relation to specific theories and in terms of general process of play therapy.</p>",
                "<p><strong>XPCL 4010-Workshop #2: Expressive Arts in Play Therapy- </strong>The therapeutic power of selected games, structured activities and expressive arts will be explored as they pertain to play therapy. Techniques specific to art, drama, children's literature, puppets, and music will be illuminated as ideal mediums through which children and adolescents express and heal themselves through the process of play therapy. Basic techniques and strategies for incorporating such tools and techniques will be described, demonstrated, and practiced.</p>",
                "<p><strong>XPCL 4005-Workshop #3: Games, Activities, and Narrative Techniques in Play Therapy- </strong>The therapeutic power of selected games, structured activities, and narrative techniques will be explored as they pertain to play therapy. Basic techniques and strategies for incorporating such tools and techniques will be described, demonstrated, and practiced.</p>",
                "<p><strong>XPCL 4015- Workshop #4: Systematic Interventions: Family Play Therapy and Filial Therapy- </strong>Fundamental, theoretical, and philosophical concepts related to systems theory and utilizing play therapy techniques in family counseling will be presented. Basic skills and methods to incorporate in family play therapy will be described, demonstrated, and practiced. In addition, methods will be covered illustrating how to implement filial therapy for parents to become healthy agents in their children's lives.</p>",
                "<p><strong>XPCL 4030- Workshop #5: Group Play Therapy: Play Therapy Skills and Methods in Group Work- </strong>Theoretical and philosophical concepts of Group Play Therapy with children, adolescents, and adults will be discussed. Group logistics, process, conflict resolution, and group facilitation skills will be described. Basic skills and methods to incorporate in group play therapy will be described, demonstrated, and practiced. In addition, multicultural and ethical considerations in group play therapy will be addressed.</p>",
                "<p><strong>XPCL 4025- Workshop #6: Play Therapy and Creative Interventions with Adolescents, Teens, and Adults- </strong>Research has indicated that play therapy is an effective treatment modality with people of all ages. This workshop will explore the process of play therapy and creative interventions when working with adolescents and adults. Basic skills and methods to incorporate in play therapy with adolescents and adults will be described, demonstrated, and practiced. Multicultural considerations and societal influences that specifically pertain to this population will also be addressed.</p>",
                "<p><strong>XPCL 4020- Workshop #7: &nbsp;Utilizing Sandtray in Play Therapy- </strong>Through experiential sand tray exercises and didactic methods, information about the rationale, history, and general application of sand tray in play therapy will be illustrated. Basic facilitation skills, theoretical constructs, and strategies for processing sand tray will be discussed, demonstrated, and practiced.</p>",
                "<p><strong>XPCL 4045- Workshop #8: Addressing Trauma, Grief, and Loss Through Play Therapy- </strong>This workshop will investigate specific issues faced by children, adolescents, and families affected by difficult environmental and systematic situations. The implications of trauma, grief, and loss as a result of abuse, crisis, death and divorce will be reviewed as they pertain to the process. The process of play, techniques, treatment plans and consultation procedures will also be explored. Skills and methods to incorporate play therapy techniques to address trauma, grief, and loss will be described, demonstrated, and practiced.</p>",
                "<p><strong>XEDC 1511- General Financial Planning Principles, Professional Conduct, and Regulation- </strong>This course examines basic financial planning concepts for developing client relationships; gathering, analyzing, and evaluating financial documents, statements, and other information; developing and communicating relevant recommendations to clients; implementing recommendations through the use of a financial planning team; and monitoring the financial plan on a periodic basis, all within CFP Board professional and regulatory standards. Students will develop a pragmatic perspective of the field of financial planning as they learn to analyze personal financial statements, understand time value of money concepts, explore education funding techniques, advise clients regarding the management of debt, apply behavioral finance concepts, gain an understanding of federal and state regulatory requirements, learn the ethical environment of financial planning and integrate the legal and economic aspects of financial planning within a practice.</p>",
                "<p><strong>XEDC 1512- Risk Management, Insurance, and Employee Benefits Planning- </strong>This course explores fundamental insurance, annuity, and employee benefit concepts and products. Students will gain knowledge of the principles of risk and insurance; learn how to analyze and evaluate risk exposures; and understand the concepts of personal and business insurance for life, health, disability, long-term care and property insurance. Students will also develop perspectives regarding the integration of social insurance (e.g. Medicare, workers compensation) within the framework of financial planning. Equity-based compensation, non-qualified deferred compensation and other employee benefits will also be presented and discussed.</p>",
                "<p><strong>XEDC 1513- Investment Planning- </strong>This course examines the characteristics, uses and taxation of investment vehicles: stocks, bonds, cash and cash equivalents, promissory notes, guaranteed investment contracts, real estate, and alternative investments. Students will also develop an understanding of the various types of risk: systematic and unsystematic, purchasing power, interest rate, business, and financial risk. Students are introduced to quantitative investment concepts, measures of investment returns, bond and stock valuation concepts, investment theory, portfolio development and analysis, investment strategies, asset allocation, and asset pricing models.</p>",
                "<p><strong>XEDC 1514- Tax Planning- </strong>This course focuses on income tax fundamentals and calculations, tax accounting, characteristics and income taxation of business entities, basis, depreciation, and cost recovery concepts. The impact of the alternative minimum tax (AMT), passive activity, at-risk rules, charitable contributions and charitable deductions on a client’s financial plan is also studied. Students will gain an understanding of the tax consequences of like-kind exchanges and the disposition of property and will learn how the loss of a spouse through death or divorce affects a client’s tax status.</p>",
                "<p><strong>XEDC 1515- Retirement Savings and Income Planning- </strong>Students will be exposed to retirement needs analyses, types and characteristics of retirement plans, qualified plan rules and options, and provisions of tax-advantaged plans. The effects of ERISA on retirement plans is examined and the impact of Social Security on a client’s retirement plan is also discussed. Students will gain an understanding of plan distribution options, rules, alternatives, and taxation, and will also explore key factors affecting plan selection for businesses and investment considerations for retirement plans.</p>",
                "<p><strong>XEDC 1516- Estate Planning- </strong>This course analyzes the various techniques and strategies used in developing estate plans based on client criteria and needs. Property titling, property transfer at death, gifting strategies, and sources of estate liquidity are discussed. Students will also gain insight on wills, probate, and the types, uses and taxation of trusts during estate planning.</p>",
                "<p><strong>XEDC 1517- Capstone: Financial Plan Development Course- </strong>Students participate in a case analysis and evaluation in which the following major areas of financial planning are integrated:</p>",
                "<p><strong>XEDC 1165- SHRM Learning System-</strong> The SHRM Learning System for SHRM-CP and SHRM-SCP includes five modules covering the comprehensive SHRM Body of Competency and Knowledge™ (SHRM BoCK™) so you'll learn everything you need for the SHRM-CP or SHRM-SCP exam. Study with learning modules that provide an in-depth exploration of the knowledge domains and behavioral competencies tested on the SHRM exams. SHRM Certified Professional (SHRM-CP™) and SHRM Senior Certified Professional (SHRM-SCP™) are the new standard for all HR professionals around the globe, as it is among the first HR certification that is focused on the practical, real-life information HR professionals need to excel in their careers today, including behavioral competencies, knowledge and skills.</p>",
                "<p><strong>XEDC 1164- SHRM Essentials-</strong> The perfect course for managers who need to know basic HR concepts BEFORE disciplinary action is required and HR has to get involved. This program provides a broad overview of the human resource function. &nbsp;Key topic areas include: Essentials of HR Management, Employment Law, Effective Recruitment, Basics of Compensation, and Orienting and Training your employees.</p>",
                "<p><strong>XLGL 3010- Paralegal Certificate Program-</strong> This face-to-face offering is taught by an esteemed faculty of judges and attorneys. Students learn legal processes, court structure, interviewing, investigation, document preparation, file maintenance, correspondence, research, writing and analysis, as well as substantive topics of law, such as Tort Law, Contract Law and Civil Procedures. Students will be trained in online legal research with individual subscriptions to LexisNexis and Westlaw.</p>",
                "<p><strong>XLGL 3020- Paralegal Certificate Program, Self-Paced-</strong> The self-paced version of our Paralegal Certificate program is designed for students to study when convenient for them and can be done completely online. Students will be assigned their own attorney/judge liaison and learn legal processes, court structure, interviewing, investigation, document preparation, file maintenance, correspondence, research, writing and analysis, as well as substantive topics of law, such as Tort Law, Contract Law and Civil Procedures. Students will be trained in online legal research with individual subscriptions to LexisNexis and Westlaw.</p>",
                "<p><strong>XLSS 5010- Lean Six Sigma Green Belt Certification- </strong>This program focuses on managing quality projects utilizing the fundamentals of Lean and Six Sigma methodologies. Lean topics include the concepts of the elimination of waste and reduction of cycle time in organizational processes. Six Sigma principles consist of problem solving techniques, data collection and analysis, reduction of process variation, process capability and control, and continual improvement.</p>",
                "<p><strong>XLSS 5040- Lean Six Sigma Black Belt Certification-</strong> Build upon the process improvement skills acquired during the Green Belt certification with our industry-leading Lean Six Sigma Black Belt certification. In just seven sessions over the course of two to three months, you'll master the tools to mentor Green Belts and other team members using real-world process improvement methods. Black belts leverage the tools and concepts in their lean six sigma \"toolbox\" to successfully lead projects that deliver meaningful results to the organization.</p>",
                "<p><strong>XCYS 1050- Cybersecurity Fundamentals-</strong>&nbsp; This course is designed to introduce participants to the critical field of cybersecurity, emphasizing the skills and knowledge needed to navigate the evolving threat landscape. It adopts a workshop format to ensure a comprehensive learning experience, incorporating a mix of lectures, case studies, and hands-on labs. The course aims to prepare learners for the ISACA Cybersecurity Fundamentals Certificate Exam by covering a wide range of topics, from cybersecurity principles and privacy to risk management and security architecture.</p>",
                "<p><strong>XCYS 2050- Cybersecurity Bootcamp-</strong> Students gain hands-on experience, which provides preparation for real-world scenarios. This intensive program is taught by experienced professionals who contribute valuable insight on information security and cybersecurity and prepare students to pass top industry certifications.</p>",
                "<p><strong>XDGM 2020- Digital Marketing Bootcamp-&nbsp;</strong> The Digital Marketing Bootcamp is a part-time Career Bootcamp that teaches the essential skills necessary to launch a digital marketing career. Learners will start&nbsp; with the fundamentals and progress through a variety of strategies and topics to solve complex marketing challenges within the evolving tech space.</p>",
                "<p><strong>XSWD 2010- Software Development Bootcamp- 24 Week Part-Time-</strong> Over the course of 24 weeks, you will learn how to build, test, and deploy software applications using JavaScript on the client- (front-end) and server-side (back-end) of an application. Starting with fundamentals, you will quickly move into more complex programming concepts that are solidified through challenges, such as: pair programming, weekly projects, lab exercises, and code reviews. The projects that you create throughout the program will be used to build your portfolio, which will serve as a showcase of your work and be a valuable asset in your post-bootcamp job hunt. You will also receive time with a professional career mentor through one-on-one coaching sessions and bi-weekly workshops. In the final four weeks, you will work with a client and your classmates on a team to develop a real product. This is what we call your “capstone project”. At the end of the program, you will demonstrate your capstone project to an audience of hiring partners and tech community members at our Demo Day. This bootcamp part-time bootcamp is typically held during the weekday evenings and weekends.</p>",
                "<p><strong>XSWD 2020- Software Development Bootcamp- 12 Week Intensive-</strong> Over the course of 12 weeks, you will learn how to build, test, and deploy software applications using JavaScript on the client- (front-end) and server-side (back-end) of an application. Starting with fundamentals, you will quickly move into more complex programming concepts that are solidified through challenges, such as: pair programming, weekly projects, lab exercises, and code reviews. The projects that you create throughout the program will be used to build your portfolio, which will serve as a showcase of your work and be a valuable asset in your post-bootcamp job hunt. You will also receive time with a professional career mentor through one-on-one coaching sessions and bi-weekly workshops. In the final four weeks, you will work with a client and your classmates on a team to develop a real product. This is what we call your “capstone project.\" At the end of the program, you will demonstrate your capstone project to an audience of hiring partners and tech community members at our Demo Day. This intensive bootcamp is typically held each weekday, all day.</p>",
                "<p><strong>XDAB 2010- Data Science and Analytics Bootcamp, Extended Class-</strong> The Data Analytics Bootcamp is a part-time, flex, mentor-led, Career Bootcamp that covers a variety of tools used to drive and guide complex, big data-oriented decisions.&nbsp; Learners will become experts in analysis, cleaning, mining, synthesis, and decision-making in order to influence key decisions with an increasingly complex business environment.</p>",
                "<p><strong>XUIX 2010- UX/UI Design Bootcamp- </strong>The process for creating the outward facing appearance of a website or application is referred to as user interface (UI) design, while the process of gathering research and using data to inform design decisions is referred to as user experience (UX) design. In this program, you will learn both. Starting with the fundamentals, you will quickly advance through topics of increasing complexity, applying creative problem-solving skills to design, and iterating on your designs based on research. You will learn how to defend your designs with data using performance metrics that you create. Lastly, you will leave this program knowing how to clearly implement every step of the design process, from concept to full-scale design prototypes.</p>",
                "<p><strong>XTSB 2010- Tech Sales Bootcamp- </strong>The Tech Sales Bootcamp is an intensive program designed to provide learners with the skills and knowledge needed to succeed in today's digital marketplace. This program will help you understand technology sales concepts, develop relationships with clients, and quickly adapt to changing customer needs.</p>",
                "<p><strong>XITS 4000- IT Systems Support Specialist- </strong>Our online, asynchronous program is designed to equip you with the necessary skills and knowledge to become an IT Support Specialist. The program comprises multiple modules that cover essential topics such as technical support, hardware and operating systems, software, programming and databases, networking and storage, cybersecurity essentials, and cloud computing.</p>",
                "<p><strong>XITS 4010- Fundamentals of IT-</strong> The Fundamentals of IT program delivers comprehensive insights into basic computing principles and essential hardware components, ensuring a solid foundation in information technology through an in-depth exploration. This offering includes the following certification(s): CompTIA ITF+</p>",
                "<p><strong>XITS 4020- Microsoft Office Specialist-</strong> The Microsoft Office Specialist program provides essential computer skills, along with training in business communication, etiquette, and problem-solving, covering a broad range of topics necessary for proficiency in the modern workplace. This offering includes the following certification(s): Microsoft Office Specialist (MOS)&nbsp;</p>",
                "<p><strong>XITS 4030- AWS Solutions Architect Associate-</strong> This AWS Certification course caters to IT specialists aiming to elevate their career path with a focus on Cloud technology within the information technology domain. This offering includes the following certification(s): AWS Certified Solutions Architect - Associate (CSAA)&nbsp;</p>",
                "<p><strong>XITS 4040- Cybersecurity Analyst (CySA+)-</strong> The Cybersecurity Analyst program prepares participants for a profession in cybersecurity, with a focus on defensive tactics designed to protect organizations against emerging threats and vulnerabilities. This offering includes the following certification(s): CompTIA CySA+</p>",
                "<p><strong>XITS 4050- Ethical Hacker (PenTest+)-</strong> The Ethical Hacker program prepares participants for a cybersecurity career, focusing on offensive tactics designed to proactively defend organizations from potential threats and ensure their digital assets remain secure. This offering includes the following certification(s): CompTIA PenTest+&nbsp;</p>",
                "<p><strong>XITS 4060- Cloud Computing (Cloud+)-</strong> The CompTIA Cloud+ Certification training program is tailored for IT professionals aiming to expand their roles, enhance their income prospects, and demonstrate their proficiency in the dynamic field of cloud computing. This offering includes the following certification(s): CompTIA Cloud +</p>",
                "<p><strong>XITS 4070- Linux Administrator-</strong> Gain the vital skills necessary for a back-end IT professional, focusing on the installation, configuration, and maintenance of Linux operating systems, ensuring robust and efficient technological infrastructures. This offering includes the following certification(s): CompTIA Linux+</p>",
                "<p><strong>XITS 4080- IT Network Technician-</strong> The IT Network Technician program is designed to impart knowledge in a range of networking technologies, fostering expertise in network administration and support, equipping learners with the skills necessary for professional advancement in the field. This offering includes the following certification(s): CompTIA Network+</p>",
                "<p><strong>XITS 4090- IT Security Specialist-</strong> The IT Security Specialist program enables students to elevate their IT careers by achieving expertise in the security domain, through a comprehensive 6-week curriculum dedicated to cultivating advanced protective strategies and knowledge. This offering includes the following certification(s): CompTIA Security+&nbsp;</p>",
                "<p><strong>XITS 4100- Project Management Essentials-</strong> Project Management Essentials equips participants with the crucial skills needed to manage and direct projects successfully across various industries, ensuring effective leadership and organizational outcomes. This offering includes the following certification(s): Certified Associate in Project Management (CAPM)</p>",
                "<p><strong>XITS 4110- Information Systems Security Professional-</strong> The Information Systems Security Professional certification represents the pinnacle of achievement and the most esteemed credential in the realm of data security, setting the industry standard for excellence and expertise. This offering includes the following certification(s): Certified Information Systems Security Professional (CISSP)</p>",
                "<p><strong>XITS 4120- Cisco Certified Network Associate-</strong> The Cisco Certified Network Associate certification is perfect for IT professionals aiming to advance their careers by mastering comprehensive computer networking skills. This offering includes the following certification(s): Cisco Certified Network Associate (CCNA)</p>",
                "<p><strong>XITS 4130- PC Technician-</strong> The PC Technician program equips learners with the capabilities to manage, troubleshoot, and resolve problems with personal computers, offering an extensive IT curriculum that covers all essential aspects of PC maintenance and repair. This offering includes the following certification(s): CompTIA A+</p>",
                "<p><strong>XITS 4140- Cloud Technology Professional-</strong> The Cloud Technology Professional program offers a prime opportunity for IT professionals looking to progress in their careers with a specialization in cloud computing. This offering includes the following certification(s): CompTIA Cloud+; AWS Certified Solutions Architect - Associate (CSAA)&nbsp;</p>",
                "<p><strong>XITS 4150- Healthcare IT Technician-</strong> The Healthcare IT Technician program offers a comprehensive educational experience for those aiming to enter the healthcare industry with a focus on Information Technology (IT), preparing individuals for a specialized career at the intersection of health and technology. This offering includes the following certification(s): CompTIA Network+, CompTIA A+, Certified Electronic Health Records Specialist (CEHRS)</p>",
                "<p><strong>XITS 4160- IT Help Desk Administrator-</strong> The IT Help Desk Administrator program serves as an ideal entry point into the IT field, concentrating on the development and upkeep of network systems for businesses and organizations, preparing participants for critical support roles. This offering includes the following certification(s): CompTIA Network+, CompTIA A+</p>",
                "<p><strong>XITS 4170- IT Security and Network Technician-</strong> The IT Security and Network Technician training program propels your career forward in the specialized fields of IT security and network administration, offering advanced knowledge and skills for a competitive edge in these critical areas of technology. This offering includes the following certification(s): CompTIA Network+, CompTIA Security+</p>",
                "<p><strong>XITS 4180- IT Support Professional-</strong> The IT Support Professional program offers an ideal starting point for those interested in pursuing advanced IT certifications, providing the foundational knowledge and skills necessary for success in the IT field. This offering includes the following certification(s): CompTIA IT Fundamentals (CompTIA ITF+), CompTIA A+</p>",
                "<p><strong>XITS 4190- Networking Specialist-</strong> The Networking Specialist program delivers two certifications designed to solidify your foundation for a robust career in networking, equipping you with the skills and knowledge essential for success in this dynamic field. This offering includes the following certification(s): Cisco Certified Technician (CCT) – Routing and Switching, CompTIA Network+&nbsp;</p>",
                "<p><strong>XITS 4200- Cloud Specialist-</strong> The Cloud Specialist program provides an in-depth understanding of cloud computing concepts, equipping learners to excel in achieving three key certifications fundamental to a successful career in the cloud technology landscape. This offering includes the following certification(s): Microsoft Azure Fundamentals, AWS Certified Cloud Practitioner, CompTIA Cloud+</p>",
                "<p>Old Dominion University will no longer be admitting new cohorts to the Career Switcher program. Although we will continue to support current students enrolled in the Career Switcher program through Spring 2025, we will no longer be offering the program for prospective students. For students who have completed Level I and are entering or already taking Level II professional development, your modules will continue to be available to you as needed, through Spring 2025. <em>The Career Switcher program is certified by the Virginia Department of Education.</em></p>",
                "<p>Assistant Director for Curriculum and Development:&nbsp; Pete Baker<br>\nAssistant Director for Student Support:&nbsp; Samantha Fabio</p>",
                "<p><strong>Level II Preparation: </strong>Preparation begins during the first year of employment.&nbsp;Career Switchers attend a minimum of five seminars to expand the intensive preparation requirements associated with instructional topics.&nbsp;&nbsp;The five seminars award a minimum of 20 cumulative instructional hours and feature various instructional techniques. During Level II, a school mentor is assigned to assist the candidate throughout their first year of employment.&nbsp;&nbsp;&nbsp;&nbsp;</p>",
                "<p><strong>XPCL 5096- How’s Your First Year Going- 4 contact hours- </strong>This workshop deals with issues that first-year teachers face or have encountered. This workshop is designed&nbsp;to support new teachers and facilitate the successful entry of transitioning beginning teachers into the teaching profession by addressing topics that impact their day-to-day professional and teaching decisions.</p>",
                "<p><strong>XPCL 5097- Communication Skills for Teachers- 4 contact hours- </strong>This workshop deals with the relationships and communication skills teachers need to develop with students,&nbsp;parents, administrators, and colleagues. This workshop will focus on appropriate and effective ways to communicate with parents,&nbsp;administrators, colleagues, and&nbsp;students, providing some guided practice.&nbsp;The session&nbsp;will include an analysis of stakeholders, a review of types of teacher communications, some positive techniques and strategies, and an evaluation&nbsp;of several real-world examples.</p>",
                "<p><strong>XPCL 5098- Data Driven Instruction for Student Achievement- 4 contact hours- </strong>Per the Virginia Department of Education, “Candidates will know about, create, and use appropriate and effective measurements in teaching that shall provide dependable information about student achievement. This course will discuss what evidence should be collected of candidates' success in the first years of teaching and the candidates' impact on student achievement.”</p>",
                "<p><strong>XPCL 5085- Behavior Management- 4 contact hours-</strong> Candidates will acquire strategies to help prevent behavior problems, identify actions that need to be taken when behavior problems occur, and learn how to effectively help students resolve problems in the classroom.</p>",
                "<p><strong>XPCL 5086- Empowering Teachers who serve English as a Language Learners (ESL)- 4 contact hours- </strong>The ESL workshop is designed to give new teachers some basic information about who the ESL students are. The workshop is mandatory because at some point of the participants teaching experience, they will have ELL students in their classroom. The participants will learn how the ESL students make it into the classroom. Participants will also get some teaching strategies useful when differentiating their instruction for English Language Learners. The goals of the workshops are to identify how these ESL students are enrolled, Demonstrate and create awareness about ESL students various Linguistic Proficiency level and what that means to the classroom teacher. Participants will become familiar with ESL Assessment like the WAPT and annual ACCESS for ESL students. Participants will learn about culture and multicultural in the classroom and how to use this knowledge when planning instruction. Finally, participants will develop awareness about LEP students SOL accommodations and how these accommodations impact ESL students with Special Education needs.&nbsp;</p>",
                "<p><strong>XPCL 5088- Strategies for Success in the Classroom- 4 contact hours- </strong>Candidates will acquire practical strategies that they will be able to use with their students.&nbsp;&nbsp;This workshop includes instructional, vocabulary, memory, and review activities that can be used with any student, including slow learners and special education students.&nbsp;</p>",
                "<p><strong>XPCL 5089- Poverty:&nbsp;&nbsp;Students Achievement for Rural Urban Learners- 4 contact hours- </strong>Candidates will learn strategies to promote students’ academic success effectively with urban and rural learners in poverty based on theoretical concepts.&nbsp;&nbsp;Additionally, they will gain insights regarding the impact of poverty for schools, leaders, teachers and students. The participants will engage in a variety of experiences for adult learners to increase the teachers’ awareness of poverty and educators’ roles to address student scholastic achievement in school. The workshop will explore through the use of this PowerPoint presentation as guidance document to support practical application in this seminar. This interactive session will highlight the poverty research by Dr. Ruby Payne.&nbsp;</p>",
                "<p><strong>XPCL 5090- The Teacher as a Professional:&nbsp;Communicating with Stakeholders- 4 contact hours- </strong>Participants will become familiar with the issues and standards related to professionalism and teacher evaluation. The participants will become familiar with The Virginia Standards for the Professional Practice of Teachers (VSPPT) and discuss expectations for teacher conduct within and without the classroom. Concrete strategies and tools for interaction with students, parents, administrators, and colleagues will be provided.&nbsp;Participants will engage in role-play to appreciate their responsibility in building supportive relationships with their students and their families.&nbsp;In addition, Assessment of, and for, Student Learning will be addressed, as grading is the primary mode of communication with parents, particularly at the secondary level.&nbsp;</p>",
                "<p>&nbsp;<strong>XPCL 5091- Parents:&nbsp;A User’s Guide- 4 contact hours- </strong>This workshop will deal with the relationship teachers need to develop with parents, outline concerns from a parent's perspective, from a school's perspective, and develop responses to those concerns.&nbsp;This workshop will employ teaching strategies embedded into the PowerPoint, therefore providing practical application to the content (Communication with Parents).&nbsp;The agenda will include overviews and strategies, definition of stakeholders, analysis of the types of teacher-parent communication, presentation of positive techniques and strategies, and the review, evaluation, and practical use of authentic case studies.</p>",
                "<p><strong>XPCL 5093- Diversity in the Classroom- 4 contact hours- </strong>Participants will define diversity and identify what constitutes diversity in the classroom.&nbsp;Students will discern personal subjectivities and examine how those subjectivities affect student populations in the classroom.&nbsp;Students will understand the microsystem, exosystem, and macrosystem that influences the development of individuals through Bronfenbrenner’s Ecological Model. Students will engage with culture, language, and socioeconomic status to gain a deeper understanding of the backgrounds students come with&nbsp;to school.</p>"
            ]
        }
    }
]