[
    {
        "department": "The Graduate School",
        "academicLevel": "Graduate",
        "overview": "<p>Department website: <a href=\"http://www.odu.edu/graduateschool\" target=\"_blank\" rel=\"noopener\">http://www.odu.edu/graduateschool</a></p><p>Shana Pribesh, Interim Dean<br>\nBryan Porter, Associate Dean<br>\nMissy Barber, Director for Administration &amp; Academic Services<br>\nLiz Smith, Director, Interdisciplinary Initiatives&nbsp;</p>\n<p>2102 Monarch Hall<br>\n757-683-4885</p>\n<h2>Overview&nbsp;</h2>\n<p>The Graduate School's mission is to support graduate programs, graduate students, and postdoctoral fellows by coordinating and optimizing available resources and advocating for new resources. We also ensure policies and practices are developed and applied across the University's academic colleges. And finally, we serve as advocates for graduate education within the University, across the region, the nation, and the world. The Graduate School is dedicated to the principles of access, equity, inclusion, and diversity. As a part of that support, the Graduate School houses the University's graduate interdisciplinary programs, the PhD in Biomedical Sciences program, the Graduate Certificate in Homeland Security, and the Graduate Certificate in Conservation Leadership.&nbsp; By managing interdisciplinary programs centrally, the Graduate School is able to coordinate efforts across colleges, schools, and departments.&nbsp;</p>",
        "programs": {
            "Doctor of Philosophy Programs": [
                "Biomedical Sciences with a Concentration in Bioelectrics (PhD)",
                "Biomedical Sciences with a Concentration in Bioinformatics and Genomics (PhD)",
                "Biomedical Sciences with a Concentration in Biological Chemistry (PhD)",
                "Biomedical Sciences with a Concentration in Microbiology and Immunology (PhD)",
                "Biomedical Sciences with a Concentration in One Health (PhD)",
                "Biomedical Sciences with a Concentration in Stem Cells and Regenerative Medicine (PhD)"
            ],
            "Certificate Program": [
                "Conservation Leadership Certificate",
                "Homeland Security Certificate"
            ]
        },
        "courses": {}
    }
]