[
    {
        "department": "Patricia and Douglas Perry Honors College",
        "academicLevel": "Undergraduate",
        "overview": "<p>Department website: <a href=\"http://www.odu.edu/honors\" target=\"_blank\" rel=\"noopener\">http://www.odu.edu/honors</a></p><p>Shuntay Tarver, Ph.D., Dean</p>\n<p>The Patricia and Douglas Perry Honors College offers a four-year program where select incoming freshmen, current sophomores, and transfer students enjoy the opportunity to personalize and co-design their honors experience at Old Dominion.&nbsp; Throughout their Honors College experience, students are encouraged to participate in undergraduate research and community engagement starting in their first year with their honors general education courses. &nbsp;In their sophomore year, Honors College students have the opportunity to apply what they have learned&nbsp;through research apprenticeships and&nbsp;by developing a one-credit civic&nbsp;learning project in consultation with the Dean of the Honors College. Contract courses are available for Honors College students to deepen their knowledge of course material for courses on the 300/400 level that are three credits or more. In their senior year, Honors College students participate in a three-credit senior honors colloquium, departmental capstone course, or honors thesis, which provides them with the opportunity to hone their research skills and assess their academic strengths in preparation for graduate school, international scholarship opportunities, and future employment.&nbsp; &nbsp;Throughout their time in the Honors College, students will create and maintain an E-Portfolio, which will be showcased in their senior year prior to graduation.</p>\n<p>The online application for admission into the Honors College is available on the Honors College website: <a href=\"https://www.odu.edu/honors/apply\">https://www.odu.edu/honors/apply</a>. All students must submit a minimum of one letter of recommendation attesting to the applicant's scholastic ability from an instructor; however, students may submit more letters of recommendation, and they are invited to submit a portfolio showcasing their accomplishments.&nbsp; &nbsp;</p>\n<p>Being an Honors College graduate is a prestigious accomplishment, one that is viewed favorably by graduate schools and potential employers everywhere. Additional benefits include:</p>\n<ul>\n\t<li>Honors College students can apply to live in Honors Housing. Applications for Honors Housing must be made directly to the Office of Housing and Residence Life. The Office of Housing and Residence Life prioritizes requests based on the date BOTH the application and housing deposit are received.&nbsp;</li>\n\t<li>Honors College students have the ability to schedule an appointment with the Dean of the Honors College for personalized letters of recommendation.</li>\n\t<li>Honors College students enjoy faculty privileges at the library.</li>\n\t<li>Tuition scholarships for HNRS courses, including study abroad.&nbsp;</li>\n\t<li>All Honors College students may register for classes on the first day of the registration period.</li>\n\t<li>Exclusive scholarship opportunities, including the John and Kate Broderick Opportunity Scholarship:&nbsp;<a href=\"https://www.odu.edu/honors/scholarship\">https://www.odu.edu/honors/scholarship</a>.</li>\n\t<li>Honors College students can apply for travel grants to offset the costs of travel to a national or international conference at which they are presenting.</li>\n\t<li>Honors College students may apply for up to $500 to offset the costs of equipment and supplies for the completion of research related to a research apprenticeship, honors contract course, or a senior honors thesis/project.</li>\n\t<li>Upon completion of the requirements of the Honors College, students are awarded a certificate, a medal, and a silver tassel.</li>\n</ul>\n<p>Competition for acceptance into the Honors College is keen. The criteria used to select the limited number of first-year students admitted annually include high school grade point average and curriculum, Scholastic Aptitude Test scores, letters of recommendation, and a written personal statement.</p>\n<p>The minimum admission requirements for continuing and transfer students are as follows: a 3.5 college grade point average, the ability to complete at least 48 additional credit hours at Old Dominion University, and letters of recommendation from college faculty members. Honors College students must maintain at least a 3.25 cumulative grade point average.</p>\n<h2>Honors College Requirements</h2>\n<table class=\"sc_courselist\">\n<caption class=\"hidden noscript\">Course List</caption>\n<colgroup>\n<col class=\"codecol\">\n<col class=\"titlecol\">\n<col align=\"char\" char=\".\" class=\"hourscol\">\n</colgroup>\n<thead>\n<tr class=\"hidden noscript\">\n<th scope=\"col\">Code</th>\n<th scope=\"col\">Title</th>\n<th scope=\"col\" class=\"hourscol\">Credit Hours</th>\n</tr>\n</thead>\n<tbody>\n<tr class=\"even firstrow\"><td colspan=\"2\"><span class=\"courselistcomment\">Honors General Education and Honors Contract Course Requirements</span></td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Four honors courses</span> <sup>*</sup></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td colspan=\"2\"><span class=\"courselistcomment\">Capstone Requirement (select one in addition to the ePortfolio**):</span></td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Capstone Course (Colloquium, Thesis, or Departmental Capstone Course)</span></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20499\" title=\"HNRS&nbsp;499\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 499');\">HNRS&nbsp;499</a></div></td><td>Senior Honors Thesis</td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><span class=\"courselistcomment\">Experiential Learning Component (select one in addition to <a href=\"/search/?P=HNRS%20387\" title=\"HNRS&nbsp;387\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 387');\">HNRS&nbsp;387</a>):</span></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20387\" title=\"HNRS&nbsp;387\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 387');\">HNRS&nbsp;387</a></div></td><td>Honors Civic Learning Project</td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Honors College options for:  Study Abroad, Teacher Preparation, Practicum, or Internship may be developed to fulfill the experiential learning component requirements.</span></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td colspan=\"2\"><span class=\"courselistcomment\">Undergraduate Research: Complete two of the following</span></td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Approved Undergraduate Research Course</span></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20226\" title=\"HNRS&nbsp;226\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 226');\">HNRS&nbsp;226</a></div></td><td>Undergraduate Research Apprenticeship</td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Out of Class Educational Poster or Oral Presentation</span></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Successful application for and completion of an Undergraduate Research Grant Project</span></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td colspan=\"2\"><div style=\"margin-left:20px;\" class=\"blockindent\"><span class=\"courselistcomment commentindent\">Publication of an article in a research journal</span></div></td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20201\" title=\"HNRS&nbsp;201\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 201');\">HNRS&nbsp;201</a></div></td><td>Monarch Think Tank I</td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20301\" title=\"HNRS&nbsp;301\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 301');\">HNRS&nbsp;301</a></div></td><td>Monarch Think Tank II</td><td class=\"hourscol\"></td></tr>\n<tr class=\"even\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20497\" title=\"HNRS&nbsp;497\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 497');\">HNRS&nbsp;497</a></div></td><td>Honors Independent Study</td><td class=\"hourscol\"></td></tr>\n<tr class=\"odd\"><td class=\"codecol\"><div style=\"margin-left:20px;\" class=\"blockindent\"><a href=\"/search/?P=HNRS%20498\" title=\"HNRS&nbsp;498\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 498');\">HNRS&nbsp;498</a></div></td><td>Honors Independent Study</td><td class=\"hourscol\"></td></tr>\n<tr class=\"even lastrow\"><td colspan=\"2\"><span class=\"courselistcomment\">Campus Events</span> <sup>***</sup></td><td class=\"hourscol\"></td></tr>\n</tbody>\n</table>\n\n<dl class=\"sc_footnotes\" aria-label=\"Footnotes\"><dt>*</dt><dd start-indent=\"23%\"><p class=\"noindent\">Either honors general education or honors contract.</p></dd><dt>**</dt><dd start-indent=\"23%\"><p class=\"noindent\">An ePortfolio is a digital collection of student work developed across varied contexts (classes, internships, social activities, etc.) over time. &nbsp;As students progress through a course of study at ODU, an ePortfolio can serve as a repository for their work. &nbsp;As a result, when the need arises for students to reflect on and display their experiences, they may draw on the archived material, crafting a showcase portfolio for potential employers and faculty writing recommendations. Due to its digital nature, an ePortfolio allows students to create and share multi-media elements, such as videos, audio files, animation, and so forth. &nbsp;Honors College students will create and maintain an ePortfolio showcasing work in and out of class while in the Honors College, which will be reviewed each semester. The Honors College provides workshops, as well as individualized support to assist students in the development of the ePortfolio.</p></dd><dt>***</dt><dd start-indent=\"23%\"><p class=\"noindent\">Honors College students are required to attend one campus event per semester for up to 8 semesters.</p></dd></dl>\n<h2>Undergraduate Research Program</h2>\n<p><span class=\"apple-converted-space\">Under the leadership of the Perry Honors College, the undergraduate research program&nbsp; includes an annual symposium, undergraduate research courses, a journal, a recognition program for faculty mentors and student researchers, as well as a robust grant program. T</span>he Undergraduate Research Program promotes, supports, and funds the involvement of undergraduate students in the active research community at Old Dominion University. &nbsp;It provides undergraduates with hands-on experience working with faculty on a wide variety of research projects. Faculty mentors help students to acquire research skills early in their undergraduate careers. Later in their academic careers, students use and develop these skills through research-oriented course work, collaborative and faculty-sponsored research, and their own independent research projects, which can be potentially funded through Old Dominion’s Undergraduate Research and Creativity Grant Program. The Undergraduate Research Symposium and Undergraduate Research Journal provide students with the opportunity to present and publish their work under the supervision of the University’s distinguished faculty. Additional information regarding undergraduate research opportunities is available on the Undergraduate Research Program’s website: <a href=\"https://www.odu.edu/honors/research\">https://www.odu.edu/honors/research</a>.</p>\n<h2>Contract Honors Courses</h2>\n<p>Students with a grade point average of at least 3.25 may transform any upper-division course into an Honors course on an individual basis. With the advice and consent of the instructor, students take one or more courses that can be converted into Honors. No grade below B is accepted for Honors designation. In addition, contract honors courses may be used to meet requirements for departmental honors. Interested students should contact the Honors College for additional information.</p>\n<h2>The Perry Honors College (PHC) and Batten College of Engineering &amp; Technology Engineering Honors Program (EHP)</h2>\n<p>A partnership between the Perry Honors College and the Batten College of Engineering and Technology, the Engineering Honors Program (PHC/EHP) offers a program for select incoming freshmen, current ODU students, and transfer students.&nbsp; The program has been designed for students who intend to make a difference in the world and who would enjoy the opportunity to ready themselves for future leadership positions in the field of engineering.&nbsp;&nbsp; Throughout their PHC/EHP experience, students will have the opportunity to network with industry leaders, and they are encouraged to participate in undergraduate research, as well as experiential learning (such as engineering competitions, community engagement, internships, and study abroad). In their freshman year, PHC/EHP students may elect to live in the Honors Engineering living learning community, and they will enjoy an honors engineering course that focuses on hands-on learning in engineering labs and Engineering Makerspace &amp; Invention Center. In their sophomore and junior years, PHC/EHP students will extend their learning beyond the classroom by participating in research apprenticeships and by developing a one-credit civic learning project in consultation with the Dean of the Honors College. In their sophomore and junior years, Contract courses (courses that are not labeled as honors but that the instructor can adapt to an honors student to make it an honors course) are available for PHC/EHP students to deepen their knowledge of course material for courses on the 300/400 level that are three credits or more. In their senior year, PHC/EHP students can request a faculty member to generate a senior elective honors three-credit contract course where student will hone their research skills and assess their academic strengths in preparation for graduate school and future employment.&nbsp;&nbsp;</p>\n<p>The online application for admission into the Engineering Honors Program is available on the Perry Honors College website: <a href=\"https://www.odu.edu/honors/apply\">https://www.odu.edu/honors/apply</a>. All students must submit a resume, an essay describing how engineers might help to solve a contemporary real-world problem, and one letter of recommendation from an instructor attesting to the applicant's scholastic ability in an area relevant to engineering and their potential as a future leader in the field of engineering. As applications are reviewed holistically, students are encouraged to submit a portfolio showcasing their accomplishments in leadership, research, or in activities related to the field of engineering; a LinkedIn page with pictures and videos of projects and experiences is an optional solution to organize such portfolio&nbsp;&nbsp;</p>\n<h3>Eligibility</h3>\n<p><u>First-year Students</u></p>\n<ul>\n\t<li>Application and acceptance into ODU</li>\n\t<li>Application to the PHC/EHP</li>\n\t<li>3.5 unweighted High School GPA in math and science courses</li>\n\t<li>Students must have an intended major in the Batten College of Engineering and Technology and placement in Calculus I (<span class=\"sc_courseinline\"><a href=\"/search/?P=MATH%20211\" title=\"MATH&nbsp;211\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'MATH 211');\">MATH&nbsp;211</a></span>) or higher before the start of their first semester.&nbsp;</li>\n\n</ul>\n\n<p><u>Transfer Students</u></p>\n<ul>\n\t<li>&nbsp;Application and acceptance into ODU</li>\n\t<li>Application to the PHC/EHP</li>\n\t<li>3.5 cumulative GPA and 3.5 in math and science courses, including completion of Calculus I (<span class=\"sc_courseinline\"><a href=\"/search/?P=MATH%20211\" title=\"MATH&nbsp;211\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'MATH 211');\">MATH&nbsp;211</a></span>) before joining ODU.</li>\n\n</ul>\n\n<p><u>Current ODU Students:</u></p>\n<ul>\n\t<li>Application to the PHC/EHP</li>\n\t<li>3.5 cumulative GPA (ODU) and 3.5 GPA (ODU) in math and science courses, including completion of Calculus I (<span class=\"sc_courseinline\"><a href=\"/search/?P=MATH%20211\" title=\"MATH&nbsp;211\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'MATH 211');\">MATH&nbsp;211</a></span>) with a minimum grade of C.&nbsp;</li>\n\n</ul>\n\n<h3>Benefits</h3>\n<ul>\n\t<li>A stipend of $250 per semester for up to eight semesters as an undergraduate student</li>\n\t<li>PHC/EHP students can apply to live in the Honors Engineering Living Learning Community. Applications for the LLC must be made directly to the Office of Housing and Residence Life. The Office of Housing and Residence Life prioritizes requests based on the date BOTH the application and housing deposit are received. Students will have preference to select single rooms.</li>\n\t<li>PHC/EHP students can schedule an appointment with the Dean of the Honors College and the Dean’s Office of the College of Engineering and Technology for personalized letters of recommendation.</li>\n\t<li>PHC/EHP students enjoy faculty privileges at the library.</li>\n\t<li>Honors advising services that focus on opportunities and helping the student develop a portfolio of accomplishment at Old Dominion.</li>\n\t<li>Tuition scholarships for HNRS courses, including <span class=\"sc_courseinline\"><a href=\"/search/?P=HNRS%20396\" title=\"HNRS&nbsp;396\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 396');\">HNRS&nbsp;396</a></span> (honors study abroad).</li>\n\n\t<li>PHC/EHP students may register for classes on the first day of the registration period following their first semester at Old Dominion.</li>\n\t<li>PHC/EHP students have exclusive scholarship opportunities, including the John and Kate Broderick Opportunity Scholarship: <a href=\"https://www.odu.edu/honors/scholarship\">https://www.odu.edu/honors/scholarship</a>.</li>\n\t<li>PHC/EHP students can apply for travel grants to offset the costs of travel to a national or international conference at which they are presenting.</li>\n\t<li>PHC/EHP students may apply to the Honors College for up to $500 to offset the costs of equipment and supplies for the completion of research related to a research apprenticeship, honors contract course, or a senior honors thesis/project.</li>\n\t<li>Reserved study time in a studio at the Engineering Systems Building.</li>\n\t<li>Special access to the Engineering Makerspace &amp; Invention Center activities.</li>\n\t<li>Early acceptance in the linked undergraduate – graduate programs in engineering.</li>\n\t<li>Special funding for projects and entrepreneurial activities.</li>\n\t<li>Mentoring program with faculty and opportunities to mentor other engineering students.</li>\n\t<li>Upon completion of the requirements of the Perry Honors College/Engineering Honors Program, students are awarded a certificate, a medal, and a silver tassel, and they will receive a special transcript designation.&nbsp;</li>\n\t<li>Students with significant accomplishments in undergraduate research may petition to have the designation “Research Honors Scholar” placed on their transcript.&nbsp; For additional information, students may contact the Perry Honors College or review the Undergraduate Research Honors Scholar information on the Perry Honors College website.</li>\n\t<li>Upon completion of the requirements of the Perry Honors College/Engineering Honors Program, PHC/EHP students who meet the following requirements may also apply for an honors designation on their diploma (departmental honors):&nbsp; Minimum cumulative GPA of 3.25; Minimum GPA in the major of 3.50; completion of at least two 300/400-level courses designated by the department to be honors; and completion of at least 60 credit hours at Old Dominion, 54 of which must be in grade-point graded courses.&nbsp; Note:&nbsp; To determine eligibility for departmental honors, the student’s complete record, including grades and hours for courses that have been forgiven or adjusted, will be evaluated to calculate the final grade point average.</li>\n</ul>\n\n<h3>Program Requirements</h3>\n<p>Requirement 1: Perry Honors College/Engineering Honors Program ePortfolio/LinkedIn*</p>\n<p>Requirement 2: Honors Courses (four required): Honors <span class=\"sc_courseinline\"><a href=\"/search/?P=ENGN%20121\" title=\"ENGN&nbsp;121\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'ENGN 121');\">ENGN&nbsp;121</a></span> (required for first-year students); select three from the following: <span class=\"sc_courseinline\"><a href=\"/search/?P=ENGL%20231C\" title=\"ENGL&nbsp;231C\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'ENGL 231C');\">ENGL&nbsp;231C</a></span>:&nbsp; Honors Section of Technical Communication, HNRS Independent Study (if approved by Honors College), honors general education courses, honors contract courses in engineering, engineering graduate courses taken as an undergraduate (e.g., those taken as part of a linked program).</p>\n\n<p>Requirement 3: Experiential Learning and Leadership (select at least two from the following): engineering internship (may be repeated), participation in engineering competitions (e.g. concrete canoe, solar decathlon, motorsports, SAE aero, and Intelligent Ground Vehicle) or engineering projects with social impact (e.g., engineers without borders), <span class=\"sc_courseinline\"><a href=\"/search/?P=HNRS%20387\" title=\"HNRS&nbsp;387\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 387');\">HNRS&nbsp;387</a></span>&nbsp;(Civic Learning Project), <span class=\"sc_courseinline\"><a href=\"/search/?P=HNRS%20396\" title=\"HNRS&nbsp;396\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 396');\">HNRS&nbsp;396</a></span> (study abroad, when connected to engineering)</p>\n\n<p>Requirement 4: Undergraduate Research (select at least two from the following):&nbsp; <span class=\"sc_courseinline\"><a href=\"/search/?P=HNRS%20226\" title=\"HNRS&nbsp;226\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'HNRS 226');\">HNRS&nbsp;226</a></span> (undergraduate research apprenticeship) or equivalent experience, poster or oral presentation at a regional/ national/international conference, successful application for and completion of an Undergraduate Research Grant project (see undergraduate research program webpage for additional information), authorship or co-authorship of an article accepted or published in a peer-reviewed journal or conference proceedings, a Research Experience for Undergraduates (REU) for fall, spring, or summer.&nbsp; Note:&nbsp; Successful work in a faculty member’s lab or a research-oriented internship may also be counted toward this requirement.</p>\n\n<p>Requirement 5: Campus Events. PHC/EHP student are required to attend at least one campus event (e.g., internship fair, engineering club meeting, the PHC’s undergraduate research symposium) per semester.</p>\n<p>Optional requirement: Contract Course - Honors Engineering Senior Elective.</p>\n<p>*An ePortfolio is a digital collection of student work developed across varied contexts (classes, internships, social activities, etc.) over time.&nbsp; As students progress through a course of study at ODU, an ePortfolio can serve as a repository for their work.&nbsp; As a result, when the need arises for students to reflect on and display their experiences, they may draw on the archived material, crafting a showcase portfolio for potential employers and for faculty writing recommendations. Due to its digital nature, an ePortfolio allows students to create and share multi-media elements, such as videos, audio files, animation, and so forth.&nbsp; Honors College students will create and maintain an ePortfolio showcasing work in and out of class while in the Honors College, which will be reviewed each semester. The Honors College provides workshops, as well as individualized support to assist students in the development of the ePortfolio. Placing all e-portfolio information on the student LinkedIn page is a requirement.</p>\n<p>For additional information about the Honors College, visit the web site at&nbsp;<a href=\"http://www.odu.edu/honors\">http://www.odu.edu/honors</a> or contact:</p>\n<p>Shuntay Tarver, Ph.D.<br>\nDean of The Patricia and Douglas Perry Honors College<br>\n1126B Monarch Hall<br>\nOld Dominion University<br>\nNorfolk VA 23529-0076<br>\n(757) 683-3033</p>",
        "programs": {},
        "courses": {
            "Honors (HNRS)": [
                "HNRS 100",
                "HNRS 101",
                "HNRS 109",
                "HNRS 200",
                "HNRS 201",
                "HNRS 226",
                "HNRS 250G",
                "HNRS 300",
                "HNRS 301",
                "HNRS 326",
                "HNRS 368",
                "HNRS 386T",
                "HNRS 387",
                "HNRS 389",
                "HNRS 390",
                "HNRS 395",
                "HNRS 396",
                "HNRS 400",
                "HNRS 401/501",
                "HNRS 402",
                "HNRS 490",
                "HNRS 497",
                "HNRS 498",
                "HNRS 499"
            ]
        }
    }
]