[
    {
        "department": "School of Nursing",
        "academicLevel": "Graduate",
        "overview": "<p><a href=\"http://www.odu.edu/nursing\">http://www.odu.edu/nursing&nbsp; </a></p>\n<p>1881 University Drive, Virginia Beach Higher Education Center<br>\n757-683-4298</p>\n<p>Karen Karlowicz, Interim Dean<br>\nJanice Hawkins, Chair Advanced Practice Nursing, Graduate Program Director</p>\n<h2>Graduate Nursing Programs</h2>\n<p>The School of Nursing offers graduate programs leading to the Master of Science in Nursing (M.S.N) and the Doctor of Nursing Practice (D.N.P). All graduate nursing programs are offered in an online/hybrid and on-campus format with the exception of Nurse Anesthesia. Graduate nursing programs are designed to prepare graduates with expertise in theory, research, and advanced nursing practice. Through academic courses and clinical experiences, graduate students are prepared to meet the present nationwide demand for nurses in advanced practice, leadership and education. The graduate nursing program is fully accredited by the Commission on Collegiate Nursing Education (CCNE).</p>\n<p>Graduate students may specialize in a variety of roles. All specialties emphasize development of the nursing role through advanced theory and research. The program strives to instill leadership responsibility, professional commitment, and a holistic approach to health and nursing care in its graduates.</p>\n<p>The number of credits required for the Master of Science in Nursing degree varies and reflects specific courses and practicum requirements necessary for certification in a specialty area of professional nursing practice. Tracks in the MSN program are designed for completion in five consecutive semesters following a full-time schedule; a part-time curriculum schedule may be available for selected tracks upon request.&nbsp;</p>\n<p><span class=\"sc_courseinline\"><a href=\"/search/?P=NURS%20800\" title=\"NURS&nbsp;800\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'NURS 800');\">NURS&nbsp;800</a></span>&nbsp;and <span class=\"sc_courseinline\"><a href=\"/search/?P=NURS%20809\" title=\"NURS&nbsp;809\" class=\"bubblelink code\" onclick=\"return showCourse(this, 'NURS 809');\">NURS&nbsp;809</a></span>, incorporated into the MSN core curriculum, are required prerequisites for the DNP.&nbsp; Before completion of the MSN, graduate students will be asked to indicate whether or not they intend to continue their studies to earn the DNP.</p>\n\n<p>Refer to the School of Nursing website at <a href=\"http://www.odu.edu/nursing\">www.odu.edu/nursing</a> for program specific course schedules.</p>",
        "programs": {
            "Doctor of Nursing Practice Programs": [
                "Nursing Practice with a Concentration in Advanced Practice (DNP)",
                "Nursing Practice with a Concentration in Nurse Anesthesia (DNP)",
                "Nursing Practice with a Concentration in Nurse Executive (DNP)",
                "Nursing Practice with a Concentration in Post-Masters Psychiatric Mental Health Nurse Practitioner (DNP)"
            ],
            "Master of Science in Nursing Programs": [
                "Nursing with a Concentration in Adult Gerontology Clinical Nurse Specialist-Educator (MSN)",
                "Nursing with a Concentration in Family Nurse Practitioner (MSN)",
                "Nursing with a Concentration in Neonatal Clinical Nurse Specialist (MSN)",
                "Nursing with a Concentration in Neonatal Nurse Practitioner (MSN)",
                "Nursing with a Concentration in Nurse Midwifery (MSN)",
                "Nursing with a Concentration in Pediatric Clinical Nurse Specialist (MSN)",
                "Nursing with a Concentration in Pediatric Nurse Practitioner (MSN)",
                "Nursing with a Concentration in Psychiatric-Mental Health Nurse Practitioner (MSN)"
            ],
            "Certificate Programs": [
                "Neonatal Physician Assistant Certificate",
                "Nurse Educator Certificate",
                "Post-Professional - Adult Gerontology, Clinical Nurse Specialist Certificate",
                "Post-Professional - Family Nurse Practitioner Certificate",
                "Post-Professional - Psychiatric Mental Health Nurse Practitioner Certificate"
            ]
        },
        "courses": {
            "Nurse Anesthesia (NURA)": [
                "NURA 745",
                "NURA 746",
                "NURA 750",
                "NURA 751",
                "NURA 752",
                "NURA 753",
                "NURA 760",
                "NURA 761",
                "NURA 762",
                "NURA 797",
                "NURA 836",
                "NURA 837",
                "NURA 838",
                "NURA 841",
                "NURA 842",
                "NURA 843",
                "NURA 844",
                "NURA 845",
                "NURA 846",
                "NURA 847",
                "NURA 848",
                "NURA 853",
                "NURA 854",
                "NURA 855",
                "NURA 856",
                "NURA 857",
                "NURA 858",
                "NURA 859",
                "NURA 863",
                "NURA 864",
                "NURA 865",
                "NURA 998"
            ],
            "Nursing (NURS)": [
                "NURS 304",
                "NURS 305",
                "NURS 306",
                "NURS 310",
                "NURS 311",
                "NURS 314",
                "NURS 316",
                "NURS 317",
                "NURS 322",
                "NURS 323",
                "NURS 332",
                "NURS 333",
                "NURS 352",
                "NURS 353",
                "NURS 355",
                "NURS 356",
                "NURS 357",
                "NURS 358",
                "NURS 363",
                "NURS 369",
                "NURS 373",
                "NURS 376",
                "NURS 380",
                "NURS 381",
                "NURS 382",
                "NURS 383",
                "NURS 387",
                "NURS 393",
                "NURS 395",
                "NURS 396",
                "NURS 397",
                "NURS 398",
                "NURS 401",
                "NURS 402",
                "NURS 403",
                "NURS 410",
                "NURS 412",
                "NURS 417",
                "NURS 421",
                "NURS 422",
                "NURS 430/530",
                "NURS 440",
                "NURS 441",
                "NURS 453",
                "NURS 454",
                "NURS 455",
                "NURS 456",
                "NURS 457",
                "NURS 458",
                "NURS 459",
                "NURS 462",
                "NURS 463",
                "NURS 472",
                "NURS 473",
                "NURS 474",
                "NURS 480W",
                "NURS 481",
                "NURS 490W",
                "NURS 491",
                "NURS 492",
                "NURS 495/595",
                "NURS 498",
                "NURS 499",
                "NURS 530",
                "NURS 595",
                "NURS 650",
                "NURS 651",
                "NURS 654",
                "NURS 676",
                "NURS 699",
                "NURS 705",
                "NURS 707",
                "NURS 709",
                "NURS 713",
                "NURS 714",
                "NURS 715",
                "NURS 717",
                "NURS 718",
                "NURS 719",
                "NURS 720",
                "NURS 721",
                "NURS 722",
                "NURS 723",
                "NURS 725",
                "NURS 726",
                "NURS 727",
                "NURS 728",
                "NURS 730",
                "NURS 731",
                "NURS 734",
                "NURS 736",
                "NURS 738",
                "NURS 739",
                "NURS 751",
                "NURS 756",
                "NURS 757",
                "NURS 758",
                "NURS 760",
                "NURS 761",
                "NURS 762",
                "NURS 763",
                "NURS 764",
                "NURS 765",
                "NURS 766",
                "NURS 767",
                "NURS 770",
                "NURS 771",
                "NURS 772",
                "NURS 773",
                "NURS 774",
                "NURS 775",
                "NURS 776",
                "NURS 778",
                "NURS 779",
                "NURS 781",
                "NURS 782",
                "NURS 783",
                "NURS 784",
                "NURS 785",
                "NURS 786",
                "NURS 788",
                "NURS 789",
                "NURS 795",
                "NURS 797",
                "NURS 798",
                "NURS 800",
                "NURS 801",
                "NURS 802",
                "NURS 803",
                "NURS 805",
                "NURS 806",
                "NURS 807",
                "NURS 809",
                "NURS 810",
                "NURS 812",
                "NURS 814",
                "NURS 816",
                "NURS 817",
                "NURS 818",
                "NURS 819",
                "NURS 865",
                "NURS 866",
                "NURS 867",
                "NURS 868",
                "NURS 890",
                "NURS 895",
                "NURS 897",
                "NURS 898",
                "NURS 998",
                "NURS 999"
            ]
        }
    },
    {
        "department": "School of Nursing",
        "academicLevel": "Undergraduate",
        "overview": "<p><a href=\"http://www.odu.edu/nursing\">http://www.odu.edu/nursing</a></p>\n<p>Karen Karlowicz, Interim Dean<br>\nLynn Wiles, Undergraduate Program Director<br>\nlwiles@odu.edu</p>\n<p>The School of Nursing offers programs leading to the degrees of Bachelor of Science in Nursing, Master of Science in Nursing and Doctor of Nursing Practice.</p>\n<p>The School of Nursing <strong>pre-licensure</strong> undergraduate curriculum admits a cohort of students each fall semester. This is a full-time program where all nursing courses are completed in five consecutive semesters (fall, spring, summer, fall, spring). Upon completion of the program, graduates are eligible to take the national licensure exam (NCLEX) to become registered nurses.&nbsp;</p>\n<p>The curriculum incorporates current recommendations for undergraduate nursing education and&nbsp;is designed to get graduates into the workforce and enrolled in graduate nursing programs more quickly. There are 66 upper-division credit hours in the nursing curriculum and the number of total credits required to graduate with a Bachelor of Science in Nursing is 120. Students applying to the pre-licensure curriculum are required to have all&nbsp;lower-division departmental and general&nbsp;education courses fully completed before admission to the nursing major; there are no exceptions to this requirement. The minimum GPA for admission to the pre-licensure program is 3.00.&nbsp;</p>\n<p>The School of Nursing <strong>concurrent and post-licensure</strong> undergraduate curriculum admits a cohort of students each semester. The RN to BSN and Concurrent curriculum is offered using a year-round schedule with part-time and full-time options. The <strong>Linked BSN to MSN</strong>&nbsp;program is designed for associate degree prepared Registered Nurses&nbsp;who are pursuing MSN degrees in Advanced Practice Nursing Roles. The program allows select students, working closely with faculty advisors, to complete graduate coursework while they are still undergraduates.</p>\n<p><strong>Post-licensure </strong>students are already&nbsp;registered nurses who are returning to complete their BSN degree.</p>\n<p><strong>Concurrent</strong> students are enrolled in an associate degree nursing program (AAS/ADN) and desire to take BSN courses concurrently. Concurrent students typically take one-two RN-BSN courses in addition to their courses at their pre-licensure program.&nbsp;</p>\n<p><strong>Linked BSN to MSN&nbsp;</strong>students can count up to 9 credit hours of graduate nursing coursework toward both their undergraduate and master's degrees in nursing.&nbsp;Students in the linked program must earn a minimum of 150 credit hours (120 discrete credit hours for the undergraduate degree and 30 discrete credit hours for the graduate degree).</p>\n<p>For additional information on the curriculum or admission requirements, please contact:</p>\n<ul>\n\t<li>Chief Academic Advisor for the Undergraduate Nursing Program, Suzanne Van Orden, <a href=\"mailto:svanorde@odu.edu\">svanorde@odu.edu</a></li>\n</ul>",
        "programs": {
            "Bachelor of Science in Nursing Programs": [
                "Nursing - Concurrent Program (BSN)",
                "Nursing Post-Licensure Major (BSN)",
                "Nursing Pre-Licensure Major (BSN)"
            ]
        },
        "courses": {
            "Nursing (NURS)": [
                "NURS 304",
                "NURS 305",
                "NURS 306",
                "NURS 310",
                "NURS 311",
                "NURS 314",
                "NURS 316",
                "NURS 317",
                "NURS 322",
                "NURS 323",
                "NURS 332",
                "NURS 333",
                "NURS 352",
                "NURS 353",
                "NURS 355",
                "NURS 356",
                "NURS 357",
                "NURS 358",
                "NURS 363",
                "NURS 369",
                "NURS 373",
                "NURS 376",
                "NURS 380",
                "NURS 381",
                "NURS 382",
                "NURS 383",
                "NURS 387",
                "NURS 393",
                "NURS 395",
                "NURS 396",
                "NURS 397",
                "NURS 398",
                "NURS 401",
                "NURS 402",
                "NURS 403",
                "NURS 410",
                "NURS 412",
                "NURS 417",
                "NURS 421",
                "NURS 422",
                "NURS 430/530",
                "NURS 440",
                "NURS 441",
                "NURS 453",
                "NURS 454",
                "NURS 455",
                "NURS 456",
                "NURS 457",
                "NURS 458",
                "NURS 459",
                "NURS 462",
                "NURS 463",
                "NURS 472",
                "NURS 473",
                "NURS 474",
                "NURS 480W",
                "NURS 481",
                "NURS 490W",
                "NURS 491",
                "NURS 492",
                "NURS 495/595",
                "NURS 498",
                "NURS 499"
            ]
        }
    }
]