{
    "program_title": "Bachelor of Science in Business Administration Accounting (BSBA)",
    "academic_level": "Undergraduate",
    "tabs": [
        {
            "tab_name": "Overview",
            "content": [
                {
                    "paragraph": "Bruce Rubin, Ph.D., Interim Chair\nTo be named, Chief Academic Advisor"
                },
                {
                    "paragraph": "Accounting, as the world's oldest information system, provides information for most government, non-profit, and business decisions. Accounting graduates pursue successful careers in the public or private sectors.  The undergraduate program in accounting at Old Dominion University is one of a select group in the country with separate accreditation from AACSB-International. The program provides a broad-based education with a variety of career objectives. The Bachelor of Science in Business Administration (BSBA) in accounting provides students with technical accounting knowledge, the ability to analyze problems, communicate solutions, interact with colleagues, and successfully handle ethical issues appropriate for staff-level positions.  The program provides, at a minimum, 24 hours of accounting, which is sufficient for a graduate to sit for most accounting professional licensure and certification exams."
                },
                {
                    "paragraph": "A student who seeks a Bachelor of Science in Business Administration degree in accounting from Old Dominion University must, in addition to meeting other requirements of the University, earn a minimum of 25 percent of the total number of credits required for the degree (for example, 30 credits in a 120-credit degree program) through on- or off-campus instruction."
                },
                {
                    "heading": "Strome College of Business (SCB) Center for Undergraduate Advising and Student Success"
                },
                {
                    "paragraph": "The mission of this office is to challenge and support students in self-exploration and, through advising, provide resources for them to develop an achievable plan for success. Our vision is for students to be aware of their academic, personal, and professional goals; empowered to pursue them; and confident in their ability to accomplish them."
                },
                {
                    "paragraph": "Our professional advisors work with all freshmen, new transfer students, or students changing majors regarding admission, continuance, and graduation requirements and required curricula for the majors and minors offered by the College. Additionally, the office serves all Strome College of Business students as a satellite of the Center for Career & Leadership Development, assisting students with internships and job placement."
                },
                {
                    "paragraph": "Additionally, the Center assists students with information and access to supplemental success programs and tools such as peer tutoring, mentoring, and the Tanner Business Fellows."
                },
                {
                    "heading": "Degree Requirements"
                },
                {
                    "paragraph": "Students in all of the Bachelor of Science in Business Administration degree programs must fulfill the University General Education requirements (including foreign language) as well as the Strome College of Business's  core, major, and elective requirements. Students must choose at least one major area to meet requirements towards the degree. The major areas are: accounting, business analytics, economics, enterprise cybersecurity, finance, human resource management, international business, information systems and technology, management, marketing, personal financial planning, real estate, and risk management and insurance."
                },
                {
                    "paragraph": "To stay in compliance with AACSB accreditation standards, students receiving a Bachelor of Science in Business Administration from Old Dominion University must complete at least half of their business course work in residence with a minimum of four courses in their declared major. This equates to 10 business classes, thus meeting the University's residency requirement as well."
                },
                {
                    "paragraph": "Majors in the college may not take business and public administration courses for pass/fail credit except those courses in which pass/fail is the only grading option (i.e., internships and practica)."
                },
                {
                    "paragraph": "No more than four hours of activity credit (used as free electives) may be applied to degree requirements for students majoring within the college."
                },
                {
                    "heading": "Eligibility to Enroll in Upper-Level (300/400-level) Business Courses"
                },
                {
                    "paragraph": "Only students who have officially completed Step 1 Admission to the BSBA program (see below) will be eligible to enroll in upper-level (300/400) business courses (refer to exceptions for non-business majors). However, students who have completed Step 1 Admission but not Step 2 Admission to the BSBA program (see below) are limited to completing a maximum of 18 credit hours of upper-level business courses. Note: These students will need a Program Restriction Waiver (PRW) to enroll in any 300/400 level business or economics course, with the exception of FIN 323, MGMT 325, MKTG 311, and OPMT 303. Intended Business majors do not need a PRW to enroll in those four courses. However, there may be class standing and/or prerequisite requirements. Forms to request a PRW to enable enrollment in other 300/400 level business courses before completion of Step 2 admission are available on the Strome College of Business website."
                },
                {
                    "paragraph": "Students with extenuating circumstances may petition the Associate Dean for Academic Programs in the Strome College of Business  in writing for a one-time, one-semester waiver of the 18 hour limitation on enrollment in 300/400-level business courses without Step 2 Admission to the BSBA degree program."
                },
                {
                    "heading": "Enrollment in 300/400-level Business Courses by Non-Business Majors"
                },
                {
                    "paragraph": "Enrollment in 300/400-level business courses will be granted without Step 1 Admission or Step 2 Admission to the bachelor's degree program in business administration for the following exceptions:"
                },
                {
                    "paragraph": "Students in categories 1 - 5 above who do not have a declared major will need a Program Restriction Waiver (PRW) in order to enroll in any 300/400-level Strome College of Business course (including Economics courses). Forms to request a PRW are available at the Strome College of Business website."
                },
                {
                    "heading": "Admission to the Undergraduate Program in Business Administration"
                },
                {
                    "heading": "General Requirements"
                },
                {
                    "paragraph": "Applicants for admission to the undergraduate degree program in business administration (the Bachelor of Science in Business Administration) should apply initially to the Office of Admissions of Old Dominion University. Students cannot be accepted into business administration without first being admitted to the University. Admission to the University does not guarantee admission to the Bachelor of Science in Business Administration (BSBA) program. Candidates for admission to the BSBA program should indicate on the application to the University their intention to enter the undergraduate business administration degree program."
                },
                {
                    "paragraph": "Admission to the BSBA degree program is a two-step process. Students must first successfully complete Step 1 Admission requirements (described below), and be certified as having done so, before undertaking the requirements for Step 2 Admission to the BSBA degree program (described below)."
                },
                {
                    "paragraph": "All candidates for admission to the undergraduate business administration program should contact the Strome College of Business directly for an Application for Step 1 Admission or an Application for Step 2 Admission to the program. Applications are available on the Strome College of Business's website, in all of its department offices, and in the College's Undergraduate Advising office. Normally, students should apply for Step 1 Admission in their sophomore year. The Strome College of Business will notify students of the Step 1 Admission decision. Students should normally apply for Step 2 Admission in their junior year. The Strome College of Business will notify students of the Step 2 Admission decision. Students will remain \"Intended\" business majors until their Step 2 application has been approved."
                },
                {
                    "heading": "Admission to the Bachelor's Degree Program in Business Administration: Step 1"
                },
                {
                    "paragraph": "Before Step 1 Admission to the bachelor's degree program in business administration can be granted, a student must have earned a grade of C or higher in each of the business Step 1 Admission courses:"
                },
                {
                    "table": [
                        {
                            "course_id": "BUSN 110",
                            "course_name": "Introduction to Contemporary Business",
                            "credit": "1"
                        },
                        {
                            "course_id": "ENGL 110C",
                            "course_name": "English Composition",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 162M",
                            "course_name": "Precalculus I",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 201",
                            "course_name": "Principles of Financial Accounting",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 202S",
                            "course_name": "Principles of Microeconomics",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "paragraph": "BUSN 110 is not required for students pursuing an Information Systems and Technology major (excluding Business Analytics) or for any student with an associate's degree in business administration or with a prior bachelor's degree in business administration. Students may utilize the Grade Forgiveness Policy for the business Step 1 Admission courses."
                },
                {
                    "paragraph": "Transfer students may complete business Step 1 Admission courses BUSN 110, ENGL 110C, MATH 162M, ACCT 201, and ECON 202S at another accredited college or university, but are responsible for having Transfer Evaluation Services determine that the courses are acceptable to the University. Transfer students with associate's degrees from Virginia community colleges that have articulated transfer agreements with ODU that do not require taking ENGL 110C must substitute ENGL 211C or ENGL 231C for ENGL 110C in the list of business Step 1 Admission courses. All transfer students must have a transfer student evaluation completed by Transfer Evaluation Services to be used as documentation that the transfer courses are acceptable."
                },
                {
                    "heading": "Waiver of Eligibility Requirements to Enroll in Upper-Level Business Courses for Students Pursuing Step 1 Admission"
                },
                {
                    "paragraph": "Students with extenuating circumstances may petition the Associate Dean for Academic Programs in the Strome College of Business (Room 2004 Constant Hall) in writing for a one-time, one-semester waiver of the restriction on enrollment in upper-level (300/400) business courses without Step 1 Admission to the bachelor's degree program in business administration. Waivers will be granted under the following conditions:"
                },
                {
                    "heading": "Appealing a Denial of Step 1 Admission to the Undergraduate Business Administration Program"
                },
                {
                    "paragraph": "Students who do not achieve a grade of C or higher in the business Step 1 Admission courses BUSN 110, ENGL 110C,  MATH 162M, ACCT 201, and ECON 202S after utilizing the Grade Forgiveness Policy may appeal in writing to the Associate Dean for Academic Programs in the Strome College of Business documenting the reasons why the student should be granted Step 1 Admission to the bachelor's degree program in business administration. The Associate Dean will review the student's other coursework to determine if the student has maintained an overall 2.00 grade point average in at least 25 semester hours or 42 quarter hours from Old Dominion University or an accredited institution of higher education. In this case, the requirement for a grade of C or better in each of the Step 1 Admission courses may, at the discretion of the Associate Dean, be waived."
                },
                {
                    "heading": "Admission to the Bachelor's Degree Program in Business Administration: Step 2"
                },
                {
                    "paragraph": "Students must first successfully complete Step 1 before undertaking the requirements for Step 2 Admission to the bachelor's degree program in business administration. Students must apply for Step 2 Admission to the program no later than the end of the semester in which they complete the following requirements:"
                },
                {
                    "paragraph": "Students not meeting these requirements may refer to the appeal procedures below."
                },
                {
                    "heading": "Appealing a Denial of Step 2 Admission to the Bachelor's Degree Program in Business Administration"
                },
                {
                    "paragraph": "Students who do not fulfill the requirements for Step 2 Admission, but who have at least a 2.00 cumulative grade point average in all of the business courses taken in the Strome College of Business at Old Dominion University, may appeal in writing to the Associate Dean for Academic Programs in the Strome College of Business. The appeal must document the reasons why the student should be granted Step 2 Admission to the bachelor's degree program in business administration. In this case, the regular Step 2 Admission requirements may, at the discretion of the Associate Dean, be waived."
                },
                {
                    "heading": "Fast Track Admission to the Bachelor's Degree Program in Business Administration"
                },
                {
                    "paragraph": "Students who complete the five courses required for Step 1 of the BSBA admission process (see above) with a grade of B or higher in all five and have a cumulative GPA of 3.0 or higher are eligible for Fast Track Admission. Fast Track Admission allows the student to become fully admitted to the BSBA degree program and move from an Intended to a Declared major at the time their Step 1 application is processed. Students transferring in any of the Step 1 courses are eligible for Fast Track Admission after completing at least 12 credits of course work at ODU if they present an unofficial transcript showing earned grades of B or higher in the Step 1 courses transferred to ODU, and have a cumulative GPA of 3.0 or higher at all prior institutions and at ODU."
                },
                {
                    "heading": "Regulations for Continuance in the Bachelor of Science in Business Administration"
                },
                {
                    "paragraph": "In addition to the Old Dominion University continuance policies, the following policies are specific to all declared Bachelor of Science in Business Administration (BSBA) students. The Strome College of Business makes a reasonable effort to notify undergraduate students who are not in good academic standing in the BSBA program of their academic status. Each undergraduate student who is placed on BSBA Academic Alarm or BSBA Termination (explained below) will be sent an e-mail message to that effect at the student's Old Dominion University e-mail address, in accordance with the Electronic Communication Policy for Official University Business. Non-receipt of the e-mail messages by a student will not be considered grounds for granting exceptions or delays in enforcement of the BSBA continuance regulations."
                },
                {
                    "heading": "BSBA Continuance Regulations"
                },
                {
                    "paragraph": "At the end of each semester—fall, spring, and summer—the Strome College of Business reviews the records of all students who do not maintain at least a 2.00 cumulative grade point average (GPA) in the BSBA Core coursework and acts according to the following policies:"
                },
                {
                    "heading": "Guidelines for Filing a BSBA Termination Appeal"
                },
                {
                    "heading": "Applying for Readmission to the BSBA Program"
                },
                {
                    "paragraph": "After a minimum of five years has passed since a student was terminated from the BSBA program, the student may apply for readmission to the program. There must be a high probability the student will successfully complete the degree program, and approval will be at the discretion of the Strome College of Business Associate Dean."
                },
                {
                    "paragraph": "The decision will be based on an evaluation of the student's transcript and on a written statement from the student explaining how circumstances that previously prevented the student from succeeding have changed in the intervening time period."
                },
                {
                    "paragraph": "If readmitted, a student will be required to take all BSBA Core courses, and their prerequisites, that have not been completed with a grade of C or better, and any other courses required for the student's degree program under the most recent Undergraduate Catalog."
                },
                {
                    "paragraph": "If a student is readmitted, BSBA Core course grades of C- or lower earned before termination will not be included in future BSBA Core GPA calculations (though they will remain on the transcript)."
                }
            ]
        },
        {
            "tab_name": "Requirements",
            "content": [
                {
                    "heading": "Requirements"
                },
                {
                    "heading": "Lower-Division General Education"
                },
                {
                    "paragraph": "Oral Communication: COMM 101R or MKTG 200R required.  Additionally, all students majoring in business administration can expect to complete several courses in which individual and/or group oral presentations will be required."
                },
                {
                    "paragraph": "Mathematics: MATH 162M and MATH 200 required."
                },
                {
                    "paragraph": "Information Literacy and Research: IT 150G (recommended) or any \"G\" course from the approved general education information literacy and research course list."
                },
                {
                    "paragraph": "Human Behavior: Met in the Business Administration core for all majors except Economics."
                },
                {
                    "paragraph": "Philosophy and Ethics must be satisfied by completion of either PHIL 230E or an upper-level \"E\" course from the approved general education ethics course list. A philosophy course designated with a P will not meet this requirement for business administration students with the exception of a \"P\" course taken prior to fall 2010."
                },
                {
                    "paragraph": "Impact of Technology requirement is satisfied within each BSBA degree major except Information Systems and Technology by IT 360T. In the Information Systems and Technology majors (excluding Business Analytics), the Impact of Technology requirement is satisfied by the coursework required for the major."
                },
                {
                    "paragraph": "Transfer students with an applicable associate's degree from a Virginia Community College or another community college that has a seamless transfer agreement with ODU, and students with a prior bachelor's degree from another university, must nevertheless have a grade of C or better in the following to be able to transfer them:"
                },
                {
                    "table": [
                        {
                            "course_id": "COMM 101R",
                            "course_name": "Public Speaking",
                            "credit": "3"
                        },
                        {
                            "course_id": "PHIL 230E",
                            "course_name": "Introduction to Ethics (Or an upper-level ethics course)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ENGL 211C",
                            "course_name": "Writing, Rhetoric, and Research",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 162M",
                            "course_name": "Precalculus I",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 200",
                            "course_name": "Calculus for Business and Economics",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "heading": "Upper-Division General Education"
                },
                {
                    "heading": "Requirements for Graduation"
                },
                {
                    "paragraph": "Requirements for graduation include the following:"
                },
                {
                    "heading": "Business Administration Core"
                },
                {
                    "table": [
                        {
                            "course_id": "ACCT 201",
                            "course_name": "Principles of Financial Accounting *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 202",
                            "course_name": "Principles of Managerial Accounting *",
                            "credit": "3"
                        },
                        {
                            "course_id": "BNAL 206",
                            "course_name": "Business Analytics I *",
                            "credit": "3"
                        },
                        {
                            "course_id": "BNAL 306",
                            "course_name": "Business Analytics II",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 201S",
                            "course_name": "Principles of Macroeconomics *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 202S",
                            "course_name": "Principles of Microeconomics *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 301",
                            "course_name": "Managerial Economics",
                            "credit": "3"
                        },
                        {
                            "course_id": "FIN 323",
                            "course_name": "Introductory Financial Management",
                            "credit": "3"
                        },
                        {
                            "course_id": "FIN 331",
                            "course_name": "Legal Environment of Business",
                            "credit": "3"
                        },
                        {
                            "course_id": "IT 360T",
                            "course_name": "Principles of Information Technology **",
                            "credit": "3"
                        },
                        {
                            "course_id": "MGMT 325",
                            "course_name": "Contemporary Organizations and Management",
                            "credit": "3"
                        },
                        {
                            "course_id": "MGMT 485W",
                            "course_name": "Business Policy and Strategy (C or better) ***",
                            "credit": "3"
                        },
                        {
                            "course_id": "MKTG 311",
                            "course_name": "Marketing Principles and Problems",
                            "credit": "3"
                        },
                        {
                            "course_id": "OPMT 303",
                            "course_name": "Operations Management",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "paragraph": "Not automatically waived for transfer students with an applicable associate's degree from a Virginia Community College or another acceptable community college, or for students with a prior bachelor's degree from another university. A grade of C or better must be earned to transfer these courses to Old Dominion University."
                },
                {
                    "paragraph": "Students completing a major or minor in Information Systems and Technology (excluding the Business Analytics major) do not take this course."
                },
                {
                    "paragraph": "Students majoring in Economics must complete MGMT 485W, but meet the writing intensive requirement by earning a grade of C or better either in MGMT 485W or in one of the ECON Writing Intensive courses."
                },
                {
                    "heading": "Accounting Major"
                },
                {
                    "table": [
                        {
                            "course_id": "BUSN 110",
                            "course_name": "Introduction to Contemporary Business +",
                            "credit": "1"
                        },
                        {
                            "course_id": "MATH 200",
                            "course_name": "Calculus for Business and Economics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 305",
                            "course_name": "Essentials of Financial Accounting I (grade of C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 306",
                            "course_name": "Essentials of Financial Accounting II *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 307",
                            "course_name": "Essentials of Financial Accounting III *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 311",
                            "course_name": "Managerial Accounting *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 411",
                            "course_name": "Financial Auditing *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 425",
                            "course_name": "Taxation of Individuals *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 426",
                            "course_name": "Taxation of Business Entities *",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 460",
                            "course_name": "Accounting Information Systems *",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "paragraph": "Not required for students pursuing the IT major or for any student with an associate's degree in business administration or with a prior bachelor's degree in business administration."
                },
                {
                    "paragraph": "Grade of C- or higher required."
                },
                {
                    "paragraph": "ECON 200S cannot be used for credit by students pursuing a degree in the Strome College of Business. ECON 200S cannot be used as a free elective."
                },
                {
                    "paragraph": "Courses included in the calculation of the 2.00 overall grade point average for major course work for graduation are: all 300- and/or 400-level ACCT courses. In addition to an overall and major grade point average of 2.0, students must complete ACCT 305, Essentials of Financial Accounting I, with a grade of C or better and all other upper-division accounting courses with a grade of C- or better in order to graduate."
                },
                {
                    "heading": "Non-Required Electives"
                },
                {
                    "paragraph": "All accounting students may take one of these electives, and use the course as a free elective or 300-400 level free elective, if they have completed ACCT 305, Essentials of Financial Accounting I, with a C or better and ACCT 306, Essentials of Financial Accounting II, with a C- or better:"
                },
                {
                    "table": [
                        {
                            "course_id": "ACCT 367",
                            "course_name": "Cooperative Education",
                            "credit": "1-3"
                        },
                        {
                            "course_id": "ACCT 368",
                            "course_name": "Student Internship",
                            "credit": "1-3"
                        },
                        {
                            "course_id": "ACCT 369",
                            "course_name": "Practicum",
                            "credit": "1-3"
                        },
                        {
                            "course_id": "ACCT 405",
                            "course_name": "Accounting and Auditing in the Public/Nonprofit Sector",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 422",
                            "course_name": "Tax Research",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 450",
                            "course_name": "International and Advanced Accounting",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 495",
                            "course_name": "Selected Topics in Accounting",
                            "credit": "1-3"
                        }
                    ]
                },
                {
                    "heading": "Additional Requirements and Information"
                },
                {
                    "heading": "Advanced Placement"
                },
                {
                    "paragraph": "The college accepts advanced placement credit in accordance with the rules and regulations outlined in the Academic Information section of this catalog. Students may take College-Level Examination Program (CLEP) tests to receive credit for:"
                },
                {
                    "table": [
                        {
                            "course_id": "ACCT 201",
                            "course_name": "Principles of Financial Accounting",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 202",
                            "course_name": "Principles of Managerial Accounting",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 201S",
                            "course_name": "Principles of Macroeconomics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 202S",
                            "course_name": "Principles of Microeconomics",
                            "credit": "3"
                        },
                        {
                            "course_id": "FIN 331",
                            "course_name": "Legal Environment of Business",
                            "credit": "3"
                        },
                        {
                            "course_id": "MGMT 325",
                            "course_name": "Contemporary Organizations and Management",
                            "credit": "3"
                        },
                        {
                            "course_id": "MKTG 311",
                            "course_name": "Marketing Principles and Problems",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "paragraph": "Students are advised to contact the Office of Prior Learning Assessment for more information regarding CLEP and other prior learning assessment credit options. For advanced placement credit in any other business or public administration course, students are advised to contact the chair of the department offering the course.  Additional information about credit awarded for qualifying scores on AP and IB subject examinations can be found on the ODU website: https://www.odu.edu/academics/academic-records/score-analysis/ap-ib."
                },
                {
                    "heading": "Practical Work Experience for Business Administration Majors"
                },
                {
                    "paragraph": "Students may complement their major studies with a practical work experience, which may take the form of an internship, cooperative education experience or a class containing a real-world, hands-on project. Students must apply for internship or co-op participation through the Strome College of Business Career & Leadership Development Satellite Office. All work experiences must be approved by the faculty sponsor in the appropriate department prior to registering for credit. Students may not earn credit for previous or current work experiences. (However, academic credit for work experience may be approved in accordance with the policies for granting prior learning credit as defined in the section on Prior Learning Assessment Credit Options at the Undergraduate Level in this catalog.) For details see the Center for Career & Leadership Development section of this catalog."
                },
                {
                    "heading": "Use of Internship and Similar Hours Toward Business Administration Majors"
                },
                {
                    "paragraph": "A student may apply no more than six hours of cooperative education, student internship or practicum courses to satisfy degree requirements. Students may not use more than three hours of cooperative education, student internship or practicum courses to satisfy major elective requirements in each of the students' majors. These courses are numbered 367, 368 or 369. Additional hours of cooperative education, student internship or practicum courses, however, can be used to satisfy other requirements such as free electives or general business electives. Additional internships must each involve substantially different kinds of work experiences. Internships must be approved by the Chief Departmental Advisor of the student's major and the CAP Coordinator of the internship."
                },
                {
                    "heading": "Transfer of the Associate of Science in Business Administration Towards Degree Requirements"
                },
                {
                    "paragraph": "Students transferring to the college must complete a minimum of 10 business courses offered by the college to earn the degree from Old Dominion University, in accordance with AACSB regulations. Those transfer students holding the Associate of Science in Business Administration degree from a Virginia Community College must earn the grade of \"C\" or better in the following courses in order to satisfy requirements found in the first two years of the BSBA degree:"
                },
                {
                    "table": [
                        {
                            "course_id": "COMM 101R",
                            "course_name": "Public Speaking",
                            "credit": "3"
                        },
                        {
                            "course_id": "ENGL 211C",
                            "course_name": "Writing, Rhetoric, and Research",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 162M",
                            "course_name": "Precalculus I",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 200",
                            "course_name": "Calculus for Business and Economics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 201",
                            "course_name": "Principles of Financial Accounting",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 202",
                            "course_name": "Principles of Managerial Accounting",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 201S",
                            "course_name": "Principles of Macroeconomics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 202S",
                            "course_name": "Principles of Microeconomics",
                            "credit": "3"
                        },
                        {
                            "course_id": "BNAL 206",
                            "course_name": "Business Analytics I",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "paragraph": "With the exception of the courses listed above, the University's lower-division General Education requirements are deemed satisfied by the accepted AS degrees. These typically include all AS degrees from the Virginia Community College System except the applied science degrees. For more information about accepted AS degrees contact the Office of Admissions. Associate degree holders, although meeting lower-level General Education requirements, must ensure that 120 credits are completed to earn the BSBA degree.  A minimum of 25% of the required credit hours must be completed through Old Dominion University, at least 12 of which are upper-level courses in the major program."
                },
                {
                    "paragraph": "The Strome College of Business does not accept courses completed at the freshman and sophomore levels at other institutions for required courses at the junior and senior level at Old Dominion University. Please see the section on CLEP credits (Prior Learning Assessment Credit Options at the Undergraduate Level) for additional information."
                },
                {
                    "heading": "Grade Average Requirements for Graduation"
                },
                {
                    "paragraph": "To graduate with a Bachelor of Science in Business Administration degree, students must present a minimum of 120 hours with a minimum overall grade point average of 2.00 in all courses taken at Old Dominion University. Students must also attain a minimum overall grade point average of 2.00 in courses taken toward the major (courses included in the major grade point average calculation are listed following the description of each major's course work)."
                },
                {
                    "paragraph": "Additionally, students must attain a minimum overall grade point average of 2.00 in the BSBA Core listed below. Only courses completed at Old Dominion University will be used to compute the BSBA Core average. Students with an Information Systems and Technology major (excluding Business Analytics) are not required to take IT 360T, so the BSBA Core grade point average is computed using the remaining courses. If the BSBA Core average is below the required 2.00 minimum, students are advised to utilize the Grade Forgiveness Policy or Adjusted Resident Credit option when appropriate to improve the grade point average."
                },
                {
                    "heading": "Requirements for Completing a Bachelor of Science in Business Administration"
                },
                {
                    "paragraph": "The following sections show the courses that are requirements for all business students, regardless of the chosen major: Lower-Division General Education, BSBA Core Courses, and Upper-Division General Education. Credit hours are listed after the course title. The student must also choose a major and complete the requirements listed for that major on the following pages."
                },
                {
                    "heading": "Foundation Courses for Admission to the Strome College of Business"
                },
                {
                    "table": [
                        {
                            "course_id": "ENGL 110C",
                            "course_name": "English Composition (C or better)",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 162M",
                            "course_name": "Precalculus I (C or better)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 201",
                            "course_name": "Principles of Financial Accounting (C or better)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 202S",
                            "course_name": "Principles of Microeconomics (C or better)",
                            "credit": "3"
                        },
                        {
                            "course_id": "BUSN 110",
                            "course_name": "Introduction to Contemporary Business *",
                            "credit": "1"
                        }
                    ]
                },
                {
                    "paragraph": "Not required for students pursuing an Information Systems and Technology major (excluding Business Analytics) or for students with an associate's degree in business administration or with a prior bachelor's degree in business administration."
                },
                {
                    "paragraph": "See the section on Admission to the Undergraduate Program in Business Administration, General Requirements."
                },
                {
                    "heading": "Business Elective"
                },
                {
                    "paragraph": "A business elective is a course that is offered by an accredited college of business, including the Strome College of Business at Old Dominion University. Public Affairs and Service (PAS) courses offered by the Strome College of Business are not considered as business courses. However, because some business courses cannot be used to satisfy the requirements of certain majors, students must refer to their specific degree program requirements to make sure that they complete appropriate business elective courses. For example, ECON 200S cannot be used to satisfy an elective requirement for students majoring in business administration. Also, IT 360T cannot be used as an elective by students majoring in Information Systems and Technology. Refer to the course description section of this Catalog for full details of courses and their prerequisites."
                },
                {
                    "heading": "Free Elective"
                },
                {
                    "paragraph": "In the majority of cases a free elective is any course offered by an accredited community college or university, including Old Dominion University. However, because some courses cannot be used to satisfy the requirements of certain majors, students must refer to their specific degree program requirements to make sure that they complete appropriate elective courses. For example, ECON 200S cannot be used to satisfy an elective requirement for students majoring in business administration. Also, IT 360T cannot be used as an elective by students majoring in Information Systems and Technology. Refer to the course description section of this Catalog for full details of courses and their prerequisites."
                }
            ]
        },
        {
            "tab_name": "Degree Program Guide",
            "content": [
                {
                    "heading": "Degree Program Guide"
                },
                {
                    "paragraph": "The Degree Program Guide is a suggested curriculum to complete this degree program in four years.  It is just one of several plans that will work and is presented only as broad guidance to students. Each student is strongly encouraged to develop a customized plan in consultation with their academic advisor.  Additional information can also be found in Degree Works."
                },
                {
                    "table": [
                        {
                            "course_id": "ENGL 110C",
                            "course_name": "English Composition (Grade of C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "MATH 162M",
                            "course_name": "Precalculus I (C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "BUSN 110",
                            "course_name": "Introduction to Contemporary Business (C or better required)",
                            "credit": "1"
                        },
                        {
                            "course_id": "MATH 200",
                            "course_name": "Calculus for Business and Economics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ENGL 211Cor ENGL 231C",
                            "course_name": "Writing, Rhetoric, and Research (Grade of C or better required)or Writing, Rhetoric, and Research: Special Topics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 201",
                            "course_name": "Principles of Financial Accounting (C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 202S",
                            "course_name": "Principles of Microeconomics (C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 202",
                            "course_name": "Principles of Managerial Accounting (C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 201S",
                            "course_name": "Principles of Macroeconomics",
                            "credit": "3"
                        },
                        {
                            "course_id": "BNAL 206",
                            "course_name": "Business Analytics I",
                            "credit": "3"
                        },
                        {
                            "course_id": "BNAL 306",
                            "course_name": "Business Analytics II",
                            "credit": "3"
                        },
                        {
                            "course_id": "FIN 323",
                            "course_name": "Introductory Financial Management",
                            "credit": "3"
                        },
                        {
                            "course_id": "IT 360T",
                            "course_name": "Principles of Information Technology (Satisfies Impact of Technology)",
                            "credit": "3"
                        },
                        {
                            "course_id": "MGMT 325",
                            "course_name": "Contemporary Organizations and Management",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 305",
                            "course_name": "Essentials of Financial Accounting I (C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "OPMT 303",
                            "course_name": "Operations Management",
                            "credit": "3"
                        },
                        {
                            "course_id": "FIN 331",
                            "course_name": "Legal Environment of Business",
                            "credit": "3"
                        },
                        {
                            "course_id": "MKTG 311",
                            "course_name": "Marketing Principles and Problems",
                            "credit": "3"
                        },
                        {
                            "course_id": "ECON 301",
                            "course_name": "Managerial Economics",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 306",
                            "course_name": "Essentials of Financial Accounting II (C- or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 311",
                            "course_name": "Managerial Accounting (C- or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "MGMT 485W",
                            "course_name": "Business Policy and Strategy (C or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 307",
                            "course_name": "Essentials of Financial Accounting III (C- or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 411",
                            "course_name": "Financial Auditing (C- or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 425",
                            "course_name": "Taxation of Individuals (C- or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 426",
                            "course_name": "Taxation of Business Entities (C- or better required)",
                            "credit": "3"
                        },
                        {
                            "course_id": "ACCT 460",
                            "course_name": "Accounting Information Systems (C- or better required)",
                            "credit": "3"
                        }
                    ]
                }
            ]
        },
        {
            "tab_name": "Master's Degree Options",
            "content": [
                {
                    "heading": "Linked BSBA/MS in Accounting"
                },
                {
                    "paragraph": "Undergraduate students pursuing a BSBA in accounting at Old Dominion University may complete up to nine hours toward a Master of Science, Accounting (MS) degree by choosing from ACCT 623, ACCT 626, ACCT 627, ACCT 630, and ACCT 662 while enrolled as an undergraduate BSBA student. Students in the linked BSBA/MS program must earn a minimum of 150 credit hours (120 discrete credit hours for the undergraduate degree and 30 discrete credit hours for the graduate degree)."
                },
                {
                    "paragraph": "A student may apply to the linked BSBA/MS program after completing ACCT 305 and 12 hours from ACCT 306, ACCT 307, ACCT 311, ACCT 425, or ACCT 426 with a C or better. Students must have an overall grade point average of 3.00 in all course work taken at Old Dominion University to be admitted to the linked program. Students must apply for admission to the MS program after completion of the undergraduate degree. Students should note that being in the undergraduate accounting major does not guarantee acceptance to the MS program."
                },
                {
                    "paragraph": "Once admitted to the linked program, a student will take 600-level core graduate accounting courses, and these courses will be applied to the MS course requirements as long as the student already has 120 discrete credit hours for the undergraduate degree. By completing these nine hours, students will only have 21 hours to complete in the MS program during an additional year of study after graduating from the undergraduate program as long as the student earns 120 discrete credit hours for the undergraduate degree and 30 discrete credit hours for the graduate degree for a total of 150 credit hours."
                },
                {
                    "heading": "BSBA to MBA (Master of Business Administration) Linked Program"
                },
                {
                    "paragraph": "The linked BSBA is an early entry to the MBA program of study.  The early-entry program is designed for well-qualified ODU business administration undergraduate students to begin the MBA program prior to their completion of the undergraduate degree.  Well-qualified undergraduate students may take MBA-level courses as early as the junior year.  Undergraduate students enrolled in the program may take up to 21 hours of graduate credit that can be applied toward their undergraduate degrees. Of these 21 hours of graduate credit, up to 12 can be applied toward both the undergraduate and graduate degrees.  Students participating in the early-entry program must earn a minimum of 150 credit hours (120 discrete credit hours for the undergraduate degree and 30 discrete credit hours for the graduate degree).  Early-entry program students should carefully consider their undergraduate degree program requirements when planning their course of study.  Students in the early-entry program work in close consultation with the MBA Program Office to develop an individualized plan of study based on the required coursework outlined below."
                },
                {
                    "heading": "Admission Requirements"
                },
                {
                    "paragraph": "A potential candidate will have:"
                },
                {
                    "paragraph": "Students who have done exceptionally well in their undergraduate coursework may qualify for a GMAT waiver.  These candidates will have:"
                },
                {
                    "heading": "Admissions Procedure"
                },
                {
                    "paragraph": "Students interested in the early-entry program should complete the GMAT at least two semesters prior to the semester in which they wish to enroll. Applications to the MBA program should be submitted online following published deadlines in order to begin coursework in the desired semester. When completing the application for admission, students need to select an official admission date that is the semester immediately following their anticipated undergraduate graduation."
                },
                {
                    "paragraph": "Students interested in the program should contact the MBA Program Office as early as possible to discuss their plans for early entry.  Once admitted to the program, the MBA program manager will act as the student’s co-advisor, along with the chief departmental advisor or chief discipline advisor in the student's undergraduate major.  The MBA Program Office is located in 1026 Constant Hall.  The phone number is 757-683-3585 and email is mbainfo@odu.edu."
                },
                {
                    "heading": "Requirements for the MBA"
                },
                {
                    "paragraph": "The MBA degree requires the completion of 43 credit hours for business administration majors.  Students will work closely with their undergraduate advisor to confirm what MBA coursework can be used for the fulfillment of their undergraduate degree requirements."
                },
                {
                    "paragraph": "Students must satisfactorily complete:"
                },
                {
                    "table": [
                        {
                            "course_id": "MBA 600",
                            "course_name": "Introduction to Statistics",
                            "credit": "1"
                        },
                        {
                            "course_id": "MBA 606",
                            "course_name": "Mathematical Foundations for Business",
                            "credit": "1"
                        },
                        {
                            "course_id": "MBA 621",
                            "course_name": "Effective Business Writing",
                            "credit": "1"
                        },
                        {
                            "course_id": "MBA 638",
                            "course_name": "Spreadsheet Modeling",
                            "credit": "1"
                        },
                        {
                            "course_id": "MBA 607",
                            "course_name": "Ethical Decision Making in Business",
                            "credit": "1"
                        },
                        {
                            "course_id": "MBA 646",
                            "course_name": "Emotional Intelligence in the Workplace",
                            "credit": "1"
                        },
                        {
                            "course_id": "MBA 648",
                            "course_name": "Building a Professional Brand",
                            "credit": "1"
                        },
                        {
                            "course_id": "ACCT 609",
                            "course_name": "Managerial Accounting",
                            "credit": "2"
                        },
                        {
                            "course_id": "ACCT 611",
                            "course_name": "Financial Accounting",
                            "credit": "2"
                        },
                        {
                            "course_id": "BNAL 606",
                            "course_name": "Statistics for Managers",
                            "credit": "2"
                        },
                        {
                            "course_id": "ECON 607",
                            "course_name": "Managerial Economics",
                            "credit": "2"
                        },
                        {
                            "course_id": "FIN 613",
                            "course_name": "Financial Management",
                            "credit": "2"
                        },
                        {
                            "course_id": "IT 614",
                            "course_name": "Information and Knowledge Management",
                            "credit": "2"
                        },
                        {
                            "course_id": "MGMT 612",
                            "course_name": "Managing in Contemporary Organizations",
                            "credit": "2"
                        },
                        {
                            "course_id": "MKTG 608",
                            "course_name": "Fundamentals of Contemporary Marketing",
                            "credit": "2"
                        },
                        {
                            "course_id": "OPMT 615",
                            "course_name": "Operations & Supply Chain Management",
                            "credit": "2"
                        },
                        {
                            "course_id": "MGMT 621",
                            "course_name": "Strategic Management",
                            "credit": "3"
                        }
                    ]
                },
                {
                    "paragraph": "Business Foundations"
                },
                {
                    "paragraph": "The ODU MBA program is designed with both business and non-business undergraduates in mind.  All students are required to meet the program’s Business Foundations requirements. This set of four, one credit hour courses is designed to ensure students are prepared for the rigors of the MBA core."
                },
                {
                    "paragraph": "Sequence of Course Offerings"
                },
                {
                    "paragraph": "While there are limited prerequisites in the MBA program, students are encouraged to follow one of the plans outlined on the program website for the most effective learning plan that meets an individual’s schedule requirements.  These plans are designed to both accommodate typical student program time-to-completion needs and ensure a successful path through the coursework to program completion.  If one of the plans outlined on the website does not meet a student's professional needs, the student should contact the MBA Program Office for an individualized plan."
                },
                {
                    "heading": "MBA Electives and Concentrations"
                },
                {
                    "paragraph": "Each student must complete a minimum of nine credit hours of electives to earn a General MBA. The elective requirement may be satisfied by selecting from the wide range of electives offered in each of the functional areas in the Strome College of Business as well as from a variety of MBA topic courses.  This provides students with the flexibility to choose electives to achieve their desired educational experience.  Elective courses may be used from any graduate program at the University; however, the material must be business related and the courses pre-approved by the program office."
                },
                {
                    "paragraph": "Students may also choose the option to pursue one of the ODU MBA program’s high-impact MBA concentrations. These nine credit-hour concentrations allow students to meet all MBA graduation requirements while adding a credential to their MBA degree in a particular area of focus. Students pursuing a concentration will complete a prescribed set of MBA Depth and Elective courses as outlined in the MBA concentrations tables provided in the MBA section of the Graduate Catalog. Alternatively, students may choose to enhance their learning experience by adding a graduate certificate from those offered at Old Dominion University. Many of the available MBA concentrations listed are comprised of coursework required for an associated graduate certificate.  Graduate certificates require a minimum of 12 to a maximum of 24 credit depending upon the certificate and its learning objectives."
                },
                {
                    "paragraph": "Please note that a maximum of 12 credit hours of work at the 500-level can be applied toward the MBA program of study."
                },
                {
                    "heading": "Graduate Writing Proficiency"
                },
                {
                    "paragraph": "Students in the MBA program are required to meet the Old Dominion University writing requirement.  This can be achieved by successfully completing MBA 621."
                },
                {
                    "heading": "Continuance Policy"
                },
                {
                    "paragraph": "The MBA Program follows the University's Graduate Continuance Policy."
                },
                {
                    "heading": "BSBA to MPA (Master of Public Administration) Linked Program"
                },
                {
                    "paragraph": "The linked BSBA to MPA program provides qualified Old Dominion University undergraduate students with the opportunity to earn a master's degree in public administration while taking 12 credits of the MPA program as an undergraduate student.  The program is designed for highly motivated students with the desire to immediately continue their education after the bachelor's degree.  The program is especially relevant to individuals seeking to work (or currently working) in the public or non-profit sectors, but is suitable for students from any undergraduate major.  Graduate courses may be taken during the fall and spring semester of the student's senior undergraduate year.  After receiving the undergraduate degree, a student will continue with the MPA program, taking MPA courses until completing the required 39 credit hours. Students in the linked program must earn a minimum of 150 credit hours (120 discrete credit hours for the undergraduate degree and 30 discrete credit hours for the graduate degree)."
                },
                {
                    "heading": "Admission Requirements"
                },
                {
                    "paragraph": "A potential candidate will have:"
                },
                {
                    "paragraph": "Requirements for admission to the graduate program can be found in the School of Public Service section of the Graduate Catalog.  For additional information, please contact the School of Public Service in the Strome College of Business."
                }
            ]
        }
    ]
}