{
    "FoundationsandHistoryofEducation": {
        "Description": "This seminar explores foundational ideas of democratic education. While focusing on the contexts and conditions of contemporary education, it traces the roots of educational theory and philosophy from the formation of the common school to the policy reforms of the 21st century. This look at the present through the past provides insight into the interactions between social, economic, political, ideological, and environmental factors and its impact on the purposes of education, school curriculum and ideas of measurement and evaluation. Students will be expected to consider the implications of/for democratic education, historically and presently, as it relates to issues of race, class, gender, and multiculturalism.",
        "Skills": {
            "TechnicalAndDigitalSkills": [
                "Analyzing educational systems using digital tools",
                "Researching historical education theories online",
                "Presenting complex ideas using digital platforms",
                "Using software for data evaluation and analysis",
                "Engaging in collaborative online discussions"
            ],
            "InterpersonalAndCommunicationSkills": [
                "Discussing education's role in societal structures",
                "Collaborating with peers on multicultural education",
                "Presenting findings on race, class, and gender dynamics",
                "Writing reflective essays on educational theories",
                "Engaging in dialogue about policy reforms"
            ],
            "ProblemSolvingAndAnalyticalSkills": [
                "Evaluating the impact of policy reforms on education",
                "Analyzing the relationship between social factors and curriculum",
                "Identifying historical solutions to educational challenges",
                "Proposing improvements for democratic education",
                "Synthesizing ideas across diverse educational theories"
            ],
            "OrganizationalAndLeadershipSkills": [
                "Leading discussions on education philosophy",
                "Organizing research on historical and modern education",
                "Developing educational frameworks for diverse settings",
                "Managing projects on educational policy analysis",
                "Advocating for inclusive and democratic education systems"
            ]
        }
    }
}